[
    {
        "date": "2024-07-10",
        "title": "China's Leapmotor Aims to Take EVs Global With Stellantis Deal",
        "description": "Chinese electric car maker Leapmotor is little known outside its home country, and even there it is overshadowed by bigger players like BYD Co. and Tesla Inc."
    },
    {
        "date": "2024-07-10",
        "title": "ASX Market Open: Australian futures to rise on strong US performances",
        "description": "Australian futures are tipped to rise more than one percent this morning on record market performances in the United States."
    },
    {
        "date": "2024-07-10",
        "title": "Stocks Reach 1998 to 2000 Bubble Like Levels",
        "description": "The 2022-2024 S&P 500 has risen more than the bubble of the 1998 to 2000 bubble."
    },
    {
        "date": "2024-07-10",
        "title": "Asian Stocks Set to Track Wall Street's Tech Rally: Markets Wrap",
        "description": "Asian equities were primed for an early advance after a rally in the world’s largest tech stocks lifted US and global shares to new highs ahead of inflation data du…"
    },
    {
        "date": "2024-07-10",
        "title": "ARK Investment's Cathie Wood defends strategy in letter to investors By Reuters",
        "description": "ARK Investment's Cathie Wood defends strategy in letter to investors"
    },
    {
        "date": "2024-07-10",
        "title": "Market Today: Tesla's Energy Business Surge, HubSpot's Drop, and Semiconductor Gains",
        "description": "Market Overview\nThe stock market had a solid showing today, with major indices all jumping more than 1.0%. The S&P 500 (+1.02%) closed above 5,600 for the first"
    },
    {
        "date": "2024-07-10",
        "title": "S&P 500 spikes in last 15 minutes of US trading",
        "description": "A rally in the world’s largest technology companies sent stocks to all-time highs, with Jerome Powell’s remarks to Congress not doing much to dissuade traders from betting on Federal Reserve rate cuts this year.\n\nFor the first time in its history, the S&P 500 topped 5,600."
    },
    {
        "date": "2024-07-10",
        "title": "Future Is Bright For Super Micro Computer, But Growth Tailwinds Are Priced In (SMCI)",
        "description": "Super Micro Computer is well-positioned with its innovative offerings to benefit from ongoing investments in data centers. Learn more about SMCI stock here."
    },
    {
        "date": "2024-07-10",
        "title": "Parnassus Value Equity Fund's Strategic Moves in Q2 2024: A Deep Dive into Micron Technology's Adjustment",
        "description": "Insights into the Fund's Latest Portfolio Adjustments and Key Stock Performances\n\nParnassus Value Equity Fund (Trades, Portfolio), managed by Parnassus Investme"
    },
    {
        "date": "2024-07-10",
        "title": "How Apple Could Boost Its Revenue by Selling Ads on Apple TV+ and More",
        "description": "Apple could stand to double its revenue growth by selling ads on Apple TV+, Needham analysts said, and lifted the iPhone maker’s price target Wednesday."
    },
    {
        "date": "2024-07-10",
        "title": "DUSA: Unconvincing ETF With A High Fee (BATS:DUSA)",
        "description": "Davis Select U.S. Equity ETF is an actively managed ETF with a portfolio of only 26 companies and a 0.61% expense ratio. Check out more on DUSA here."
    },
    {
        "date": "2024-07-10",
        "title": "Morning Bid: US inflation report to set the tone By Reuters",
        "description": "Morning Bid: US inflation report to set the tone"
    },
    {
        "date": "2024-07-10",
        "title": "Amazon Stock: Swimming In Catalysts (NASDAQ:AMZN)",
        "description": "Amazon's top three catalysts are; the regionalization of its fulfillment centers, AWS, and its vast and sticky member base. Find out more on AMZN stock here."
    },
    {
        "date": "2024-07-10",
        "title": "SpaceX wins block on US labor board case over severance agreements By Reuters",
        "description": "SpaceX wins block on US labor board case over severance agreements"
    },
    {
        "date": "2024-07-10",
        "title": "S&P 500, Nasdaq rally to records on interest rate cut expectations",
        "description": "Dow Jones Industrial Average gains 1.1 per cent to 38,921.37. Read more at straitstimes.com."
    },
    {
        "date": "2024-07-10",
        "title": "S&P 500 Gains and Losses Today: Deckers Outdoor Stock Slips Amid Sales Slowdown",
        "description": "The S&P 500 added 1% on Wednesday, July 10, 2024, posting a sixth straight record close as Fed Chair Jerome Powell gave a boost to rate-cut expectations."
    },
    {
        "date": "2024-07-10",
        "title": "Visa to release $2.7B from preferred stock on Europe acquisition anniversary (NYSE:V)",
        "description": "Visa (V) to release $2.7B from convertible preferred stock on June 21, 2024, resulting in adjustments and issuance of series A preferred shares."
    },
    {
        "date": "2024-07-10",
        "title": "Fed Powell helps the stocks reach a record close once again for the S&P and Nasdaq",
        "description": "Things continue to look good. All systems are go."
    },
    {
        "date": "2024-07-10",
        "title": "HubSpot Stock Dives on Reports Alphabet Abandoning Acquisition Effort",
        "description": "HubSpot shares tumbled Wednesday after reports that Google parent Alphabet was no longer trying to buy the CRM company."
    },
    {
        "date": "2024-07-10",
        "title": "Apple targets 10% iPhone shipment growth in 2024",
        "description": "Apple targets 10% iPhone shipment growth in 2024 - Bloomberg"
    },
    {
        "date": "2024-07-10",
        "title": "U.S. Stocks Rally Ahead Of Close Watched Inflation Data",
        "description": "Following the lackluster performance seen in the previous session, stocks moved sharply higher over the course of the trading day on Wednesday. With the strong upward move, the S&P 500 closed above 5,600 for the first time ever."
    },
    {
        "date": "2024-07-10",
        "title": "U.S. Stocks Rally Ahead Of Close Watched Inflation Data",
        "description": "Following the lackluster performance seen in the previous session, stocks moved sharply higher over the course of the trading day on Wednesday. With the strong upward move, the S&P 500 closed above 5,600 for the first time ever."
    },
    {
        "date": "2024-07-10",
        "title": "Stock Market Today: S&P 500 closes above 5,600 for first time; inflation data eyed By Investing.com",
        "description": "Stock Market Today: S&P 500 closes above 5,600 for first time; inflation data eyed"
    },
    {
        "date": "2024-07-10",
        "title": "Stock market today: Big Tech surges as S&P 500 crosses 5,600 for first time",
        "description": "Jerome Powell steps up for part two of his policy update to Congress, with investors on the alert for more clues to rate-cut prospects."
    },
    {
        "date": "2024-07-10",
        "title": "TELUS & Magnite Tie-Up to Boost Streaming TV Landscape - Magnite (NASDAQ:MGNI), Motorola Solns (NYSE:MSI)",
        "description": "TELUS Corporation (NYSE: TU) recently joined forces with Magnite (NASDAQ: MGNI) – a leading global sell-side advertising company."
    },
    {
        "date": "2024-07-10",
        "title": "Zscaler Stock Reverses Course Upward: Time to Buy? - Microsoft (NASDAQ:MSFT), Amazon.com (NASDAQ:AMZN)",
        "description": "Zscaler, Inc. (NASDAQ: ZS) stock witnessed a remarkable run last year, with the share prices soaring 98% in 2023. Shares of this cybersecurity solution provider carried on the momentum in early 2024, with its share price reaching a 52-week high of $259.61 on Feb 9."
    },
    {
        "date": "2024-07-10",
        "title": "The 3 Best Vanguard ETFs for Growth Investors",
        "description": "Vanguard ETFs are among the most popular in the world. Here are the 3 best for growth investors."
    },
    {
        "date": "2024-07-10",
        "title": "Infosys to Assist Sector Alarm in Cloud ERP Migration - Infosys (NYSE:INFY)",
        "description": "Infosys Limited (NYSE: INFY), a global leader in digital services and consulting, has announced a significant five-year collaboration with Sector Alarm, a prominent European security provider partially owned by investment firm KKR."
    },
    {
        "date": "2024-07-10",
        "title": "Apple suppliers benefit from jump in iPhone shipments",
        "description": "Apple suppliers, such as Taiwan Semiconductor Manufacturing Company, stand to benefit as the company looks to boost iPhone shipment. Read more here."
    },
    {
        "date": "2024-07-10",
        "title": "Is S&P 500 Earnings Growth Finally Set To Broaden Beyond the Magnificent 7?",
        "description": "S&P 500 companies excluding the Magnificent 7 are expected to post their first quarter of year-over-year earnings growth since the fourth quarter of 2022, while growth for the Magnificent 7 slows, according to Bank of America analysts."
    },
    {
        "date": "2024-07-10",
        "title": "JPMorgan and Citigroup Q2 Earnings Previews: Both Should Have Decent Quarters",
        "description": "Stocks Analysis by Brian Gilmartin covering: Citigroup Inc, JPMorgan Chase & Co. Read Brian Gilmartin's latest article on Investing.com"
    },
    {
        "date": "2024-07-10",
        "title": "HubSpot Stock Sinks After Alphabet Pulls Plug On Potential Deal: What You Need To Know - HubSpot (NYSE:HUBS)",
        "description": "HubSpot Inc (NYSE:HUBS) shares turned sharply lower in afternoon trading Wednesday following reports that Alphabet Inc (NASDAQ:GOOG) has shelved interest in acquiring the cloud-based customer platform company."
    },
    {
        "date": "2024-07-10",
        "title": "USD: A Watered-Down Version Of NVDL",
        "description": "ProShares Ultra Semiconductors ETF offers leveraged exposure to the semiconductor industry, but heavily weighted towards Nvidia. Read more on USD ETF here."
    },
    {
        "date": "2024-07-10",
        "title": "How Tesla Energy Can Play a Big Role in the Company’s Evolution Beyond Cars",
        "description": "Stocks Analysis by The Tokenist (Timothy Fries) covering: Tesla Inc, Bitcoin. Read The Tokenist (Timothy Fries)'s latest article on Investing.com"
    },
    {
        "date": "2024-07-10",
        "title": "Shares climb, bonds rally as September Fed rate cut chances grow",
        "description": "Investors optimistic following Powell's remarks on inflation, leading to gains in shares and bond yields dip. Stay updated with Reuters."
    },
    {
        "date": "2024-07-10",
        "title": "Stocks extend their winning streak, Apple pops and the PC recovery continues",
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading."
    },
    {
        "date": "2024-07-10",
        "title": "Wells Fargo’s Scott Wren: Earnings expectations are ‘a little optimistic’",
        "description": "Consensus expectations are a bit too optimistic, and investors should continue to be conservatively positioned, said Wells Fargo strategist Scott Wren."
    },
    {
        "date": "2024-07-10",
        "title": "Google Parent Alphabet Shelves Efforts to Acquire HubSpot",
        "description": "(Bloomberg) -- Google parent Alphabet Inc. has shelved efforts to acquire HubSpot Inc., according to people with knowledge of the matter, putting to bed the prospect of a takeover that would have ranked among the biggest of the year.Most Read from BloombergSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatThe End of the Cheap Money Era Catches Up to Chelsea FC’s OwnerMicrosoft, Apple Drop OpenAI Board Plans as Scrutiny GrowsDistressed Property Buyers Seek Out ‘Exceptional Bargains’NYC"
    },
    {
        "date": "2024-07-10",
        "title": "Nasdaq Gains 1%; LegalZoom Shares Slide - LegalZoom.com (NASDAQ:LZ)",
        "description": ""
    },
    {
        "date": "2024-07-10",
        "title": "HubSpot sinks after report Google shelved acquisition plans (NYSE:HUBS)",
        "description": "Alphabet's decision not to acquire HubSpot (HUBS) causes an 11% drop in stock price."
    },
    {
        "date": "2024-07-10",
        "title": "Apple And Nvidia Stocks Boost S&P 500 And Nasdaq To All-Time Highs",
        "description": "And there’s one new potential entrant into the $1 trillion club."
    },
    {
        "date": "2024-07-10",
        "title": "DUSA: High Cost, High Conviction Research Practices Lead To Mixed Results (BATS:DUSA)",
        "description": "Davis Select U.S. Equity is a high cost, high conviction ETF benchmarked against the S&P 500. See why I recommend readers to avoid DUSA and have a sell rating."
    },
    {
        "date": "2024-07-10",
        "title": "Microsoft, Apple drop OpenAI board seat plans amid growing clampdown",
        "description": "Microsoft, which invested $13 billion in the ChatGPT creator, will withdraw from its observer role on the board, the company said in a letter to OpenAI on Tuesday"
    },
    {
        "date": "2024-07-10",
        "title": "2 Best AI Stocks for the Second Half of 2024 - Crowdstrike, Micron Technology",
        "description": ""
    },
    {
        "date": "2024-07-10",
        "title": "U.S. Stocks See Further Upside, S&P 500 Climbs Above 5,600 For First Time",
        "description": "After moving mostly higher early in the session, stocks have seen further upside over the course of the trading day on Wednesday. The major averages have all climbed firmly into positive territory, with the S&P 500 breaking above 5,600 for the first time ever."
    },
    {
        "date": "2024-07-10",
        "title": "Wall Street to see boost in Q2 from investment banking",
        "description": "Strong debt issuance, M&A expected to be revenue drivers in the quarter"
    },
    {
        "date": "2024-07-10",
        "title": "BOTZ: Outperforming Its Peers (NASDAQ:BOTZ)",
        "description": "Global X Robotics & Artificial Intelligence ETF is focused on robotics and AI, which is outperforming its peers. Find out why I rate BOTZ as a speculative buy."
    },
    {
        "date": "2024-07-10",
        "title": "Electric stuff: Tesla's business which may have more promise than autos, robots, or FSD",
        "description": "Tesla's energy storage business is booming, with Morgan Stanley forecasting major growth."
    },
    {
        "date": "2024-07-10",
        "title": "Apple set for seven straight sessions of gains",
        "description": "Apple (AAPL) stock rises as iPhone maker aims to ship 90 million iPhone 16 devices in latter half of year."
    },
    {
        "date": "2024-07-10",
        "title": "What's Going On With Nvidia, AMD Stocks On Wednesday?",
        "description": "Artificial intelligence chip stocks led by Nvidia Corp (NASDAQ:NVDA) and Advanced Micro Devices, Inc (NASDAQ:AMD) are trading higher Wednesday after leading contract chipmaker Taiwan Semiconductor Manufacturing Co (NYSE:TSM) reported June revenue growth of 33% year-on-year. The preliminary second-quarter revenue grew 32% Y/Y. Taiwan Semiconductor’s revenue growth bears testimony to the continued AI frenzy. Analysts touted Nvidia as the primary AI beneficiary, followed by AMD. Also Read: Nvidia A"
    },
    {
        "date": "2024-07-10",
        "title": "Wall Street Lunch: Tesla On A Winning Streak (undefined:TSLA)",
        "description": "Tesla winning streak could end today as shares go slightly lower."
    },
    {
        "date": "2024-07-10",
        "title": "Top Stock Movers Now: Carvana, CarMax, Nvidia, LegalZoom, and More",
        "description": "The S&P 500 and Nasdaq added to their record highs in intraday trading Wednesday amid optimism about rate cuts by the Federal Reserve."
    },
    {
        "date": "2024-07-10",
        "title": "Micron: Not An Nvidia Alternative (NASDAQ:MU)",
        "description": "Is Micron Technology, Inc. a good investment? Learn about the recent rally, competition with Nvidia, and potential entry points. Click for my MU stock update."
    },
    {
        "date": "2024-07-10",
        "title": "Trade Like Congress: 2 ETFs That Copy How Congress Members Invest",
        "description": "These are the best ETFs to track how members of Congress are investing as the portfolios are based on those of Washington, D.C. lawmakers."
    },
    {
        "date": "2024-07-10",
        "title": "Results similar to 'apple-inc-aapl-dominating-through-innovation-and-financial-resilience'",
        "description": "Search for Stocks, ETFs, Indices, Insiders, Investing Gurus and Futures on Gurufocus.com."
    },
    {
        "date": "2024-07-10",
        "title": "AMD, Taiwan Semi, lead chips higher as AI investment boom continues",
        "description": "Semiconductor stocks were mostly higher on Wednesday as the sector continued to benefit from the artificial intelligence spending boom. Read for more."
    },
    {
        "date": "2024-07-10",
        "title": "TSMC Sales Jump 40% On AI Demand, Microsoft And Apple Give Up OpenAI Board Seats, Musk Ditches Oracle - Taiwan Semiconductor (NYSE:TSM)",
        "description": "To gain an edge, this is what you need to know today."
    },
    {
        "date": "2024-07-10",
        "title": "Crude Oil Gains Over 1%; Virpax Pharmaceuticals Shares Spike Higher - Virpax Pharmaceuticals (NASDAQ:VRPX)",
        "description": ""
    },
    {
        "date": "2024-07-10",
        "title": "Vanke warns of $1.2-B loss on China’s housing slump",
        "description": "China Vanke Co. warned of hefty losses in the first half, as the country’s property downturn took a toll on the closely watched developer that’s trying to secure cash to pay off debts. State-backed Vanke expects to post a first-half loss of 7 billion yuan to 9 billion yuan ($962…"
    },
    {
        "date": "2024-07-10",
        "title": "Strategic Moves in Tweedy Browne International Value's Portfolio Highlighted by Major Stake in Porsche AG",
        "description": "Insightful Analysis of the Latest N-PORT Filing for Q2 2024\n\nTweedy Browne International Value (Trades, Portfolio), known for its Ben Graham value-oriented inve"
    },
    {
        "date": "2024-07-10",
        "title": "MercadoLibre May Be The Cheapest It Has Ever Been - Reiterate Buy (NASDAQ:MELI)",
        "description": "MercadoLibre remains the clear market leader in Latam despite Shopee's growing ambitions in the region and the devaluation observed in the Argentine peso. Learn more about MELI stock here."
    },
    {
        "date": "2024-07-10",
        "title": "Ahead of Market: 10 things that will decide D-Street action on Thursday",
        "description": "Indian stock markets hit record highs on Wednesday before reversing course. The Nifty 50 closed at 24,324, down 0.45%, while the Sensex settled at 79,924, down 0.53%. The Nifty formed a bearish engulfing pattern, suggesting potential further downside, but remained above the 24,180 support level."
    },
    {
        "date": "2024-07-10",
        "title": "Why Lantheus Holdings Stock Is Skyrocketing Today",
        "description": "Investors are cheering a proposed rule that could boost Lantheus' revenue."
    },
    {
        "date": "2024-07-10",
        "title": "Elon Musk beats $500 million severance lawsuit by fired Twitter workers By Reuters",
        "description": "Elon Musk beats $500 million severance lawsuit by fired Twitter workers"
    },
    {
        "date": "2024-07-10",
        "title": "Microsoft doubles capex, but what does GenAI monetization look like?",
        "description": "Microsoft plans to almost double its capital expenditures from $32B in fiscal year 2023 to $63B in fiscal year 2025, according to Morgan Stanley. Read more here."
    },
    {
        "date": "2024-07-10",
        "title": "DuPont is a buy at current prices for investors who don't already own the stock",
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET."
    },
    {
        "date": "2024-07-10",
        "title": "How Apple could double its revenue growth, according to top analyst Laura Martin",
        "description": "The firm said Apple can build out an advertising business to counteract \"anemic\" revenue growth."
    },
    {
        "date": "2024-07-10",
        "title": "U.S. Mostly Higher Ahead Of Key Inflation Data",
        "description": "Stocks have moved mostly higher during trading on Wednesday, with the major averages all moving to the upside after ending the previous session narrowly mixed. With the upward move, the Nasdaq and the S&P 500 have once again reached new record intraday highs."
    },
    {
        "date": "2024-07-10",
        "title": "YouTube a $455 bn media giant hiding in plain sight, say analysts",
        "description": "The streaming unit is one of the world's most valuable media companies and worth at least $455 billion on its own, Needham's Laura Martin and Dan Medina wrote in a July 3 note"
    },
    {
        "date": "2024-07-10",
        "title": "Amazon tackling EV 'barrier' as it aims for 100K vehicle deliveries by 2030",
        "description": "Amazon is working to boost the number of its electric delivery vehicles for its last mile delivery. However, its facing a similar issue as other global car manufactures: charging."
    },
    {
        "date": "2024-07-10",
        "title": "Nikola Stock: Pain Will Not End Soon (NASDAQ:NKLA)",
        "description": "Nikola's profitability remains a concern due to high production costs. Find out why I believe investors should steer clear of NKLA stock."
    },
    {
        "date": "2024-07-10",
        "title": "Advancing AI Requires Major Data Center And Digital Infrastructure Upgrades",
        "description": "The author suggests new AI data centers and many existing data centers will be fitted with specialized AI hardware, creating opportunities for component suppliers and clean energy suppliers."
    },
    {
        "date": "2024-07-10",
        "title": "Microsoft ditching OpenAI board observer spot may not quell FTC concerns: report",
        "description": "That Microsoft (MSFT) has ditched its board observer seat at OpenAI is unlikely to quell the U.S. Federal Trade Commission's concerns. Read for more."
    },
    {
        "date": "2024-07-10",
        "title": "SMART Global Posts Upbeat Results, Joins Aehr Test Systems, MarineMax And Other Big Stocks Moving Higher On Wednesday - SMART Glb Hldgs (NASDAQ:SGH)",
        "description": ""
    },
    {
        "date": "2024-07-10",
        "title": "Market Clubhouse Morning Memo - July 10th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META And TSLA) - Invesco QQQ Trust, Series 1 (NASDAQ:QQQ)",
        "description": "Good Morning Traders! In today's Market Clubhouse Morning Memo, we will discuss SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, and TSLA."
    },
    {
        "date": "2024-07-11",
        "title": "Asian stocks to gain on CPI; Japan set for Yen hit",
        "description": "Most Asian stock markets were set to advance Friday on fresh signs of slowing US inflation that sent bond yields tumbling and sparked a rotation out of big tech stocks on Wall Street.\n\nEquity futures for Australia and Hong Kong rose, while contracts for Japan fell 1.7% after the yen’s rapid appreciation against the dollar prompted reports that authorities had stepped in to support the currency."
    },
    {
        "date": "2024-07-11",
        "title": "Asian Stocks to Gain on CPI; Japan Set for Yen Hit: Markets Wrap",
        "description": "Most Asian stock markets were set to advance Friday on fresh signs of slowing US inflation that sent bond yields tumbling and sparked a rotation out of big tech sto…"
    },
    {
        "date": "2024-07-11",
        "title": "Why Tesla Stock Skidded to an 8% Loss on Wednesday",
        "description": "One product investors were very excited about might be delayed."
    },
    {
        "date": "2024-07-11",
        "title": "Big tech tumbles Most since 2022 as rate bets spur rotation",
        "description": "(July 12) : The S&P 500’s longest winning streak since November was stopped Thursday by the same cohort that’s powered the index’s yearlong rally — megacap tech.\n\nInvestors bailed out of the so-called Magnificent 7 stocks — Apple Inc., Microsoft Corp., Nvidia Corp., Alphabet Inc..."
    },
    {
        "date": "2024-07-11",
        "title": "Market Today: Nvidia Leads Tech Slump, Bezos Sells Amazon Stock, Apple Settles with EU",
        "description": "Market Overview\nIt was a solid day in the stock market following a pleasing CPI report for June, but the S&P 500 (-0.9%) and Nasdaq Composite (-2.0%) didn't ref"
    },
    {
        "date": "2024-07-11",
        "title": "Tesla walks back Robotaxi reveal, sending its stock plummeting",
        "description": "Shares of would-be taxi rivals Uber Technologies Inc. and Lyft Inc. both surged on the news."
    },
    {
        "date": "2024-07-11",
        "title": "Tracey T. Travis to Retire From The Estée Lauder Companies as Executive Vice President and Chief Financial Officer",
        "description": "NEW YORK —  The Estée Lauder Companies Inc. (NYSE: EL) today announced that Tracey T. Travis, Executive Vice President and Chief Financial Officer, has decided to r…"
    },
    {
        "date": "2024-07-11",
        "title": "Stock rotation hits megacaps on bets Fed will cut",
        "description": "Wall Street traders betting the Federal Reserve will be able to cut rates soon sent bond yields tumbling — while driving a rotation out of the tech megacaps that have powered the bull market in stocks.\n\nFurther signs that inflation is slowing down fueled speculation the Fed will be able to move as early as September."
    },
    {
        "date": "2024-07-11",
        "title": "Concentration risk? No problem, say ETF issuers",
        "description": "Here’s how capped and equal-weight ETFs can diversify a portfolio away from the Magnificent Seven"
    },
    {
        "date": "2024-07-11",
        "title": "Democracy, Redefined",
        "description": "Guess What It Means Now?"
    },
    {
        "date": "2024-07-11",
        "title": "'Warren Buffett Indicator' Sounds Alarm: Stock Market Levels Now Surpass Dot-Com Bubble, Great Financial Crisis",
        "description": "Few investors have more market experience than Berkshire Hathaway Inc (NYSE:BRK) (NYSE:BRK) CEO Warren Buffett, who's seen his fair share of over-extended bull markets. After the Dot-Com Bubble crash in 2000, Buffett noted that comparing the market capitalization of stocks to Gross Domestic Product (GDP) is the best indicator of whether equities are overvalued or undervalued at current prices. Read Next: Warren Buffett flipped his neighbor's $67,000 life savings into a $50 million fortune — How"
    },
    {
        "date": "2024-07-11",
        "title": "Morning bid: Yen rallies: CPI short squeeze or intervention? By Reuters",
        "description": "Morning bid: Yen rallies: CPI short squeeze or intervention?"
    },
    {
        "date": "2024-07-11",
        "title": "Weak June CPI Report Causes A Big Rotation In The Stock Market, As Yield Curve Steepens",
        "description": "Rotate!"
    },
    {
        "date": "2024-07-11",
        "title": "Yen rallies: CPI short squeeze or intervention?",
        "description": "GLOBAL-MARKETS/VIEW-ASIA (GRAPHIC, PIX):MORNING BID ASIA -Yen rallies: CPI short squeeze or intervention?"
    },
    {
        "date": "2024-07-11",
        "title": "Stock Market Shift: Tesla, Nvidia Lead Nasdaq Sell-Off As Small Caps Soar; JPMorgan Earnings Due",
        "description": "Stock market rotation: Nvidia, Tesla and other titans led a Nasdaq sell-off as small caps and homebuilders soared. JPMorgan earnings loom."
    },
    {
        "date": "2024-07-11",
        "title": "Gold Surges, Nasdaq Slumps: Economic Uncertainty Drives Market Shifts",
        "description": "[Chart courtesy of MarketWatch.com] The much-awaited CPI fell 0.1% last month from May, which reduced the annual inflation rate down to 3%. Expectations were for a monthly increase of 0.1% and annual rate of 3.1%. Core CPI, which excludes food and energy, and is the most closely watched number by the Fed, came in at an annual rate of 3.3%, ... Read More"
    },
    {
        "date": "2024-07-11",
        "title": "S&P 500 Gains and Losses Today: Housing Stocks Heat Up as Inflation Cools Off",
        "description": "The S&P 500 fell 0.9% on Thursday, July 11, 2024, retreating from a record high as tech stocks came under pressure following the latest inflation data."
    },
    {
        "date": "2024-07-11",
        "title": "MicroStrategy: I Still Can't Justify Buying (NASDAQ:MSTR)",
        "description": "MicroStrategy's premium to BTC decreased from 90% to 78%. Check out why I think MSTR stock is phenomenal as a trading proxy for Bitcoin."
    },
    {
        "date": "2024-07-11",
        "title": "An ‘Imminent’ Stock Market ‘Correction’ Warning Suddenly Flashed Red—As Nvidia, Apple And Tesla Crash Back",
        "description": "One analyst has pointed to a surprise stock market warning like that's just begun flashing red..."
    },
    {
        "date": "2024-07-11",
        "title": "Streak of records ends for Nasdaq, S&P 500",
        "description": "Dow Jones Industrial Average finishes up 0.1 per cent at 39,753.75. Read more at straitstimes.com."
    },
    {
        "date": "2024-07-11",
        "title": "SuRo Capital Corp. Second Quarter 2024 Preliminary Investment Portfolio Update",
        "description": "Net Asset Value Anticipated to be $6.70 to $7.20 Per Share..."
    },
    {
        "date": "2024-07-11",
        "title": "Stock market today: Tech drags indexes lower, small-caps soar after inflation data boosts rate-cut bets",
        "description": "Investors took cooler June CPI as a sign to rotate out of some of the most richly valued names in tech and into less loved  small and mid-cap stocks."
    },
    {
        "date": "2024-07-11",
        "title": "Stock Market Today: Nasdaq tumbles despite soft CPI data, Nvidia falls 5.6% By Investing.com",
        "description": "Stock Market Today: Nasdaq tumbles despite soft CPI data, Nvidia falls 5.6%"
    },
    {
        "date": "2024-07-11",
        "title": "CONCORD MEDICAL ANNOUNCES PLAN TO IMPLEMENT ADS RATIO CHANGE",
        "description": "BEIJING, July 12, 2024 /PRNewswire/ -- Concord Medical Services Holdings Limited ('Concord Medical' or the 'Company') (NYSE: CCM), a healthcare provider specialized in cancer treatment, research, education and prevention in China, today announced that it plans to change the ratio of its American depositary shares ('ADSs') to Class A ordinary shares (the 'ADS Ratio') from the current ADS Ratio of one (1) ADS representing three (3) Class A ordinary shares to a new ADS Ratio of one (1) ADS representing thirty (30) Class A ordinary shares. The Company anticipates that the change in the ADS Ratio will be effective on July 30, 2024 (U.S. Eastern Time). The ADSs of Concord Medical will continue to be traded on the New York Stock Exchange under the symbol 'CCM.'"
    },
    {
        "date": "2024-07-11",
        "title": "The Market Did Something Thursday That Has Only Occurred 4 Times In History - iShares Russell 1000 ETF (ARCA:IWB), iShares Russell 2000 ETF (ARCA:IWM)",
        "description": "2024: Small-cap stocks struggling, large-cap soaring. Possible trend reversal on June CPI report's effect on interest rates. Outlier day in history."
    },
    {
        "date": "2024-07-11",
        "title": "David beats Goliath today. Nasdaq tumbles. Russell 2000 soars",
        "description": "Russell 2000 beats Nasdaq as markets experience significant gains and losses, with tech stocks leading the decline and other sectors rising"
    },
    {
        "date": "2024-07-11",
        "title": "The U.S. just got its best inflation report in over 3 years, but stocks are still down. Here’s why",
        "description": "“Is the market down? Or is this the most extreme rotation that we've ever seen out of everything that people have been hiding in?” Eric Pachman asked."
    },
    {
        "date": "2024-07-11",
        "title": "Steve Eisman: Big tech dominance to continue, predicts Trump victory By Investing.com",
        "description": "Steve Eisman: Big tech dominance to continue, predicts Trump victory"
    },
    {
        "date": "2024-07-11",
        "title": "Thursday was a historically strange day in the stock market. That may be good news",
        "description": "The Russell 2000 small-cap index jumped more than 3% on Thursday, but every one of the so-called \"Magnficient 7\" stocks fell."
    },
    {
        "date": "2024-07-11",
        "title": "Market Strategists Thankfully Abandon S&P 500 Targets",
        "description": "Precise index projections have never served investors well."
    },
    {
        "date": "2024-07-11",
        "title": "Stock market today: Stocks fall from records as Tesla, Nvidia lead tech sell-off",
        "description": "Jerome Powell steps up for part two of his policy update to Congress, with investors on the alert for more clues to rate-cut prospects."
    },
    {
        "date": "2024-07-11",
        "title": "Earnings call: Delta Air Lines announces robust Q2 earnings and dividend hike By Investing.com",
        "description": "Earnings call: Delta Air Lines announces robust Q2 earnings and dividend hike"
    },
    {
        "date": "2024-07-11",
        "title": "Bill Nygren's Oakmark Fund 2nd-Quarter Commentary: A Review",
        "description": "SECOND QUARTER, 2024”¢ The Fund returned -3.98% versus 4.28% for the S&P 500 Index for the quarter, and 12.72% since inception, versus 10.57% for the S&P 500 I"
    },
    {
        "date": "2024-07-11",
        "title": "Nvidia leads slide as investors rotate out of mega tech",
        "description": "Nvidia dropped 4% on Thursday, and was followed by other big tech Magnificent Seven names such as Microsoft, Google, Meta and Amazon. Read more here."
    },
    {
        "date": "2024-07-11",
        "title": "Wall Street Banks Set For Bond Sales Spree After Earnings",
        "description": "Wall Street’s biggest banks are set to borrow more than they usually do after reporting second-quarter earnings, taking advantage of falling yields and tapping debt markets before the US presidential election potentially brings market turmoil later this year."
    },
    {
        "date": "2024-07-11",
        "title": "Barclays maintains underweight rating on Apple shares By Investing.com",
        "description": "Barclays maintains underweight rating on Apple shares"
    },
    {
        "date": "2024-07-11",
        "title": "Global Home Insurance Market Size To Worth USD 523.56 Billion By 2033 | CAGR Of 8.10%",
        "description": "The Global Home Insurance Market Size was Valued at USD 240.26 Billion in 2023 and the Worldwide Home Insurance Market Size is Expected to Reach USD 523.56..."
    },
    {
        "date": "2024-07-11",
        "title": "Nvidia (NVDA) Stock Quotes, Company News And Chart Analysis",
        "description": "Nvidia stock page get's you the latest news from the artificial intelligence and AI chip gaint, plus quotes and analysis."
    },
    {
        "date": "2024-07-11",
        "title": "AI ETFs in Canada: How investors can ride the AI wave",
        "description": "Here’s what to know about Canadian ETFs focused on artificial intelligence and how they might fit into your investment portfolio. Here’s what you should know about Canadian ETFs focused on artificial intelligence and how they might fit into your investment portfolio."
    },
    {
        "date": "2024-07-11",
        "title": "Tech Rally Grinds to a Halt as Investors Rotate Into Small-Cap Stocks",
        "description": "Tech stocks lost ground Thursday as investors rotated into small caps, amid hopes they could get a big boost from Federal Reserve rate cuts."
    },
    {
        "date": "2024-07-11",
        "title": "Tech Stocks Tumble As Small Caps, REITs, Gold Miners Rally; Soft June Inflation Ignites Rate Cut Expectations: What's Driving Markets Thursday?",
        "description": "A lower-than-expected inflation report for June caused wild market reactions, leading to a surge in traders’ expectations of Federal Reserve rate cuts and boosting assets that are particularly sensitive to high interest rates. As the annual inflation rate slowed from 3.3% to 3%, below the predicted 3.1%, and the monthly reading indicated the first contraction (-0.1%) in four years, traders swiftly increased their odds of a September rate cut, now placing a 92% chance. Surprisingly, large-cap ind"
    },
    {
        "date": "2024-07-11",
        "title": "Arm Holdings Hits 52-Week High: What's Next for Investors? - Qualcomm (NASDAQ:QCOM), ARM Holdings (NASDAQ:ARM)",
        "description": "Shares of Arm Holdings plc (NASDAQ: ARM) reached a 52-week high of $188.75 on Jul 9 before slightly dipping to close at $182.28."
    },
    {
        "date": "2024-07-11",
        "title": "GL INVESTIGATION ALERT: Long-term Holders of Globe Life Inc. (NYSE:GL) are Notified to Contact BFA Law about Ongoing Investigation into the Company",
        "description": "Globe Life Shareholders are encouraged to contact BFA Law about its investigation into the Board for breaches of fiduciary duties...."
    },
    {
        "date": "2024-07-11",
        "title": "Sprott says new copper fund too small to pose a market risk",
        "description": "Sprott Inc. says its new fund to buy and hold copper will be too small to impact global availability of the industrial metal. Read more."
    },
    {
        "date": "2024-07-11",
        "title": "Hasbro bolsters leadership for digital growth By Investing.com",
        "description": "Hasbro bolsters leadership for digital growth"
    },
    {
        "date": "2024-07-11",
        "title": "Big banks Q2 earnings expected to show rebounding IB, soft loan growth (NYSE:JPM)",
        "description": "Big banks start releasing Q2 earnings on Friday. While interest rates stay high and Fed rate cuts still in the future, expect soft loan growth and rising investment banking fees."
    },
    {
        "date": "2024-07-11",
        "title": "Affirm partners with RONA for flexible payment options By Investing.com",
        "description": "Affirm partners with RONA for flexible payment options"
    },
    {
        "date": "2024-07-11",
        "title": "Alphyn Capital Management Q2 2024 Letter To Investors",
        "description": "Alphyn Capital Management's Master Account returned -2.7% net in Q2 2024 vs 4.3% for the S&P500. Click here to read the full investor letter."
    },
    {
        "date": "2024-07-11",
        "title": "DGRW: I Struggle To Find A Use Case For This ETF",
        "description": "I believe WisdomTree U.S. Quality Dividend Growth ETF's simultaneous focus on growth and dividends makes it unappealing. Read more to see my analysis on DGRW."
    },
    {
        "date": "2024-07-11",
        "title": "Tesla falls 7% on reports that the robotaxi event is delayed until October (NASDAQ:TSLA)",
        "description": "Tesla (TSLA) stock dips as reports suggest delay in Robotaxi event scheduled for August 8."
    },
    {
        "date": "2024-07-11",
        "title": "[Latest] Global Automotive Electronics and Software Market Size/Share Worth USD 519,597 Million by 2033 at a 4.8% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Se",
        "description": "[220+ Pages Latest Report] According to a market research study published by Custom Market Insights, the demand analysis of Global Automotive Electronics..."
    },
    {
        "date": "2024-07-11",
        "title": "NIO Stock: No Positive Uptrends, But I Still Reiterate A Buy (NYSE:NIO)",
        "description": "Despite Q1 '24 challenges, NIO's improved margins and liquidity position suggest potential for growth and resilience in EV market. Learn more on NIO stock here."
    },
    {
        "date": "2024-07-11",
        "title": "Wall Street Lunch: Core CPI Falls To Lowest Level In Three Years",
        "description": "The consumer price index unexpectedly fell -0.1% last month, compared with expectations for a +0.1% rise."
    },
    {
        "date": "2024-07-11",
        "title": "As Valuations Around AI Skyrocket, How Should CIOs Look At Solutions?",
        "description": "The published version of Forbes’ CIO newsletter delivers the latest news for chief innovation officers and other technology-focused leaders to inboxes every Thursday."
    },
    {
        "date": "2024-07-11",
        "title": "Don't Ignore China Risk If You Are Caught Up In AI Frenzy, Euphoria Builds On Cooler CPI $2400 Gold - Conagra Brands (NYSE:CAG)",
        "description": "To gain an edge, this is what you need to know today."
    },
    {
        "date": "2024-07-11",
        "title": "Alphabet shelves bid to acquire HubSpot",
        "description": "Google parent Alphabet Inc. has shelved efforts to acquire HubSpot Inc., according to people with knowledge of the matter, putting to bed the prospect of a takeover that would have ranked among the biggest of the year. Shares of HubSpot, a customer relationship management company, fell as much as 19…"
    },
    {
        "date": "2024-07-11",
        "title": "Tesla tumbles on report it will delay robotaxi unveiling, Uber, Lyft rise By Investing.com",
        "description": "Tesla tumbles on report it will delay robotaxi unveiling, Uber, Lyft rise"
    },
    {
        "date": "2024-07-11",
        "title": "America's 10 best states for infrastructure, where you can rely on roads, bridges, airports, power, and internet",
        "description": "Hundreds of billions in federal infrastructure spending from Biden administration plans has corporations and states scrambling for a piece of the action."
    },
    {
        "date": "2024-07-11",
        "title": "Tesla is a ‘faith-based stock’ with fundamentals not grounded in the near-term - DataTrek",
        "description": "Almost three quarters of the top 10 stocks’ current valuations come from expectations for future earnings growth, according to research by DataTrek."
    },
    {
        "date": "2024-07-11",
        "title": "These 3 stocks are set to bounce once the Fed finally lowers interest rates",
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET."
    },
    {
        "date": "2024-07-11",
        "title": "PDD Expands To South America As Regulatory Headwinds Grow - eBay (NASDAQ:EBAY), Amazon.com (NASDAQ:AMZN)",
        "description": "By UOB-Kay Hian"
    },
    {
        "date": "2024-07-11",
        "title": "Congress Members Of Both Parties Make A Fortune Trading One Stock",
        "description": "Congresspeople are allowed to trade stocks — and some of their S&P 500 picks do rather well. Luckily, there's a way to cash in, too."
    },
    {
        "date": "2024-07-11",
        "title": "Tesla’s 11-day winning run prompts a valuation reality check",
        "description": "Tesla Inc. shares are climbing at a frenetic pace, but it’s becoming harder to argue the case for the bulls. Find out more."
    },
    {
        "date": "2024-07-11",
        "title": "Stock market today: S&P 500, Nasdaq fall from records amid tech sell-off",
        "description": "Jerome Powell steps up for part two of his policy update to Congress, with investors on the alert for more clues to rate-cut prospects."
    },
    {
        "date": "2024-07-11",
        "title": "Wearable AI Market is expected to Grow at an 8.3% CAGR and Reach USD 146.2 billion by 2034| Report by Transparency Market Research, Inc.",
        "description": "AI-powered wearables offer customized fitness plans and real-time coaching, adapting to individual goals and progress...."
    },
    {
        "date": "2024-07-11",
        "title": "Forecast for the S&P 500: U.S. stocks rise again, will the Rally continue?",
        "description": ""
    },
    {
        "date": "2024-07-11",
        "title": "You Know How The AI Bubble Ends",
        "description": "To reference an old-school game that predates both dotcoms and AI, you don’t want to be the one without the chair when the music stops."
    },
    {
        "date": "2024-07-11",
        "title": "U.S. Stocks Come Under Pressure After Reaching New Record Highs",
        "description": "After moving modestly higher early in the session, stocks have come under pressure over the course of the trading day on Thursday. The Nasdaq and the S&P 500 have pulled back into negative territory after reaching new record intraday highs."
    },
    {
        "date": "2024-07-11",
        "title": "Stock Market Today: Dow Jones Leads, S&P 500 Lower After CPI; Airline Stocks Descend (Live Coverage)",
        "description": "The Dow Jones and S&P 500 were mixed on the stock market today. The June Consumer Price Index reading came in lower than expected."
    },
    {
        "date": "2024-07-11",
        "title": "Hewlett Packard Enterprise Inks Pact With Nvidia To Power Japan's ABCI 3.0 To Lead As Fastest AI Supercomputer - Hewlett Packard (NYSE:HPE)",
        "description": "Hewlett Packard Enterprise and Nvidia collaborate to power Japan's ABCI 3.0, aiming to lead as the fastest AI supercomputer to meet rising computational demands."
    },
    {
        "date": "2024-07-11",
        "title": "HubSpot (HUBS) Shares Fall as Alphabet Drops Buyout Plans",
        "description": "Although company spokespersons have refused to comment on the market speculation, sources familiar with the proceedings have confirmed that Alphabet has shelved buyout plans for HubSpot (HUBS)."
    },
    {
        "date": "2024-07-11",
        "title": "Elon Musk Revisits 'Contra-Indicator' Remark On Jim Cramer: 'Amazing Part Is How Reliably Contra He Is! Statistically Impossible' - Tesla (NASDAQ:TSLA)",
        "description": "This comes after Cramer, on his show"
    },
    {
        "date": "2024-07-11",
        "title": "Market Clubhouse Morning Memo - July 11th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META And TSLA) - Invesco QQQ Trust, Series 1 (NASDAQ:QQQ)",
        "description": "Good Morning Traders! In today's Market Clubhouse Morning Memo, we will discuss SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, and TSLA."
    },
    {
        "date": "2024-07-11",
        "title": "Apple stock target raised at BofA on iPhone 16 expectations By Investing.com",
        "description": "Apple stock target raised at BofA on iPhone 16 expectations"
    },
    {
        "date": "2024-07-11",
        "title": "Mac Sales Set to Rise 20.8%: Should You Buy Apple (AAPL) Stock?",
        "description": "Apple's (AAPL) estimated strong Mac sales, AI push, growing Services business and strong liquidity position make the shares attractive for investors."
    },
    {
        "date": "2024-07-12",
        "title": "Expected US rate cuts have investors looking beyond Big Tech By Reuters",
        "description": "Expected US rate cuts have investors looking beyond Big Tech"
    },
    {
        "date": "2024-07-12",
        "title": "Bank profits slide as people struggle to pay bills",
        "description": "JPMorgan set aside $3.1 billion to cover potentially bad loans, up sharply from a year earlier, as delinquencies climb among some Americans."
    },
    {
        "date": "2024-07-12",
        "title": "JANONE CONFIRMS NAME CHANGE TO ALT5 SIGMA CORPORATION AND NEW TICKER SYMBOL TO ALTS",
        "description": "LAS VEGAS, July 13, 2024 /PRNewswire/ -- JanOne Inc. (Nasdaq: JAN), a multidisciplinary organization with a focus on fintech and healthcare, confirmed today that, as of market open on Monday, July 15, 2024, the Company's new name will be 'ALT5 Sigma Corporation' and its Nasdaq common stock ticker symbol will change to 'ALTS'. This will replace the Company's current ticker symbol 'JAN'. Further, the Company's website address will change from 'janone.com' to 'alt5sigma.com.'"
    },
    {
        "date": "2024-07-12",
        "title": "South Korea's SK On in talks to supply prismatic EV batteries as it seeks turnaround By Reuters",
        "description": "South Korea's SK On in talks to supply prismatic EV batteries as it seeks turnaround"
    },
    {
        "date": "2024-07-12",
        "title": "Why SoundHound AI Stock Skyrocketed This Week",
        "description": "After explosive bullish momentum this week, SoundHound AI stock is now up 192% this year."
    },
    {
        "date": "2024-07-12",
        "title": "Ansys merger with Synopsys moves forward, awaits China approval By Investing.com",
        "description": "Ansys merger with Synopsys moves forward, awaits China approval"
    },
    {
        "date": "2024-07-12",
        "title": "Why Arm Stock Jumped Today",
        "description": "Excitement about unfolding AI opportunities helped power another round of gains for Arm stock."
    },
    {
        "date": "2024-07-12",
        "title": "Market Today: Arbor Realty Trust Plunges, EVgo Rallies, and DOJ Targets RealPage",
        "description": "The stock market ended the week on a positive note, with the S&P 500, Dow Jones Industrial Average, and Nasdaq Composite each rising by 0.6%, and the Russell 20"
    },
    {
        "date": "2024-07-12",
        "title": "Android Circuit: Galaxy Unpacked News, Nothing Releases CMF Phone 1, OnePlus Nord 4 Details",
        "description": "This week’s Android headlines; Samsung’s new folding phones, the Galaxy Ring, Google boosts Galaxy AI, Pixel 9 names confirmed, Nothing’s latest phone, OnePlus Nord’ 4’s metal, and more..."
    },
    {
        "date": "2024-07-12",
        "title": "S&P 500 Gains and Losses Today: Wells Fargo Slips on Net Interest Income Miss",
        "description": "The S&P 500 added 0.6% on Friday, July 12, 2024, as the tech sector rebounded and earnings season kicked into gear with reports from numerous banking giants."
    },
    {
        "date": "2024-07-12",
        "title": "The blackhole inside Commonwealth Bank of Australia (ASX:CBA) shares",
        "description": "The Commonwealth Bank of Australia (ASX: CBA) share price might be up 55% over 10 years. But how fast have CBA's profits grown in that time?"
    },
    {
        "date": "2024-07-12",
        "title": "JPMorgan Chase: Building Consistency And Shareholder Trust (NYSE:JPM)",
        "description": "JPMorgan Chase & Co.'s earnings report fell short, but the stock price is stable. Click for a look at the JPM Q2 earnings results and a look at what lies ahead."
    },
    {
        "date": "2024-07-12",
        "title": "Dow Jones Futures: Broad Market Rally Powers Up On Fed Rate Cut Hopes; 4 Stocks In Buy Zones",
        "description": "Dow Jones futures: Fed rate-cut hopes fueled a broader market rally, with many stocks in buy areas. But earnings loom for a stretched Nasdaq."
    },
    {
        "date": "2024-07-12",
        "title": "Nvidia (NVDA) Outperforms Broader Market: What You Need to Know",
        "description": "Nvidia (NVDA) concluded the recent trading session at $129.28, signifying a +1.47% move from its prior day's close."
    },
    {
        "date": "2024-07-12",
        "title": "Exclusive-OpenAI working on new reasoning technology under code name ‘Strawberry’ By Reuters",
        "description": "Exclusive-OpenAI working on new reasoning technology under code name ‘Strawberry’"
    },
    {
        "date": "2024-07-12",
        "title": "First Republic ex-employees' lawsuit against US FDIC is dismissed By Reuters",
        "description": "First Republic ex-employees' lawsuit against US FDIC is dismissed"
    },
    {
        "date": "2024-07-12",
        "title": "Meta removes restrictions from Facebook and Instragram accounts of President Trump (META)",
        "description": "Meta (META) removes restrictions from Facebook and Instagram accounts of former President Trump to insure political parity. Read more here."
    },
    {
        "date": "2024-07-12",
        "title": "Steven Romick's Strategic Moves in Q2 2024 Highlighted by Major Stake in Vail Resorts Inc",
        "description": "An Insightful Look into FPA Crescent Fund's Latest Portfolio Adjustments\n\nSteven Romick (Trades, Portfolio), a seasoned portfolio manager at FPA since 1996, has"
    },
    {
        "date": "2024-07-12",
        "title": "Inslee Vows to Defend Washington State Climate Law Under Attack",
        "description": "Washington Governor Jay Inslee vowed on Thursday to defeat an attempt to repeal his state's landmark climate law."
    },
    {
        "date": "2024-07-12",
        "title": "The Dow Industrial Average average can't close at a record but closes just above 40,000",
        "description": "The Dow reached a high at 40,257.24. Failed to maintain enough gain for a record close"
    },
    {
        "date": "2024-07-12",
        "title": "Stock Market Today: Dow closes just shy of record as earnings season gets underway By Investing.com",
        "description": "Stock Market Today: Dow closes just shy of record as earnings season gets underway"
    },
    {
        "date": "2024-07-12",
        "title": "US senators introduce bipartisan bill to counter gen-AI deepfakes",
        "description": "A bipartisan group of U.S. senators has introduced legislation intended to counter the rise of deepfakes through gen-AI. Read more here."
    },
    {
        "date": "2024-07-12",
        "title": "AI Super Bulls Pay Attention To The Biggest Divergence Since 2001, TSLA Call Buyers Crushed - VanEck Semiconductor ETF (NASDAQ:SMH)",
        "description": "To gain an edge, this is what you need to know today."
    },
    {
        "date": "2024-07-12",
        "title": "Argentina Inflation Snaps Milei's Five-Month Slowdown Streak",
        "description": "Argentina recorded the first monthly pick-up in inflation of the year, marking a slight reversal of the downward streak President Javier Milei put in motion with hi…"
    },
    {
        "date": "2024-07-12",
        "title": "Dow Surges To All-Time High—Passing 40,000 For Fourth Time Ever",
        "description": "Shares of Intel, IBM and Home Depot helped drive the record-setting rally."
    },
    {
        "date": "2024-07-12",
        "title": "Stock Screener: Nvidia Leads List Of Stocks To Watch",
        "description": "Featuring Nvidia, Broadcom, Arm and more, this stock screener highlights top-rated stocks to watch right now."
    },
    {
        "date": "2024-07-12",
        "title": "Artificial Intelligence Is Fueling A 'Nuclear Renaissance'",
        "description": "Artificial intelligence has investors buzzing about new nuclear power plants. Sam Altman, Bill Gates and Jeff Bezos all play a role."
    },
    {
        "date": "2024-07-12",
        "title": "Banks Dissapointed Wall Street With Net Interest Income - JPMorgan Chase (NYSE:JPM)",
        "description": "The earnings season has been offically kicked off by JP Morgan Chase (NYSE: JPM) that reported earnings and revenue well beyond Wall Street estimates. But other big banks also joined in with their second quarter reports."
    },
    {
        "date": "2024-07-12",
        "title": "Citigroup Profits Rise 10% in Q2: So Why is its Stock Price Falling?",
        "description": "Citigroup stock plunged 4% on Friday despite a 10% increase in earnings. The cause was a federal fine over insufficient internal controls."
    },
    {
        "date": "2024-07-12",
        "title": "Ericsson Q2 Earnings Miss Estimates, Top Line Falls - Motorola Solns (NYSE:MSI), Telefonaktiebolaget L M (NASDAQ:ERIC)",
        "description": "Ericsson (NASDAQ: ERIC) reported modest second-quarter 2024 results, with the top line surpassing the Zacks Consensus Estimate and the bottom line missing the same."
    },
    {
        "date": "2024-07-12",
        "title": "S&P 500 Rises Over 1%; Citigroup Reports Upbeat Q2 Results - Citigroup (NYSE:C), Kazia Therapeutics (NASDAQ:KZIA)",
        "description": ""
    },
    {
        "date": "2024-07-12",
        "title": "David Rolfe's Wedgewood Partners 2nd-Quarter Letter: 'Apple of Our AI'",
        "description": "”\u009cApple Computer's sustainable growth, we believe, is a powerful function of a multi-product foundation whose growth is driven by product excellence, ease-of-u"
    },
    {
        "date": "2024-07-12",
        "title": "Why Rivian Stock Roared Ahead 10% on Friday",
        "description": "Thanks again to Volkswagen, Rivian's stock is soaring."
    },
    {
        "date": "2024-07-12",
        "title": "JPMorgan Chase CFO observes 'robust' dialogue in equity capital markets, M&A (NYSE:JPM)",
        "description": "JPMorgan Chase's Q2 earnings show optimism in investment banking, with a focus on equity capital markets and M&A activity, despite a muted IPO market."
    },
    {
        "date": "2024-07-12",
        "title": "European shares hit over 1-month high on earnings, Fed rate-cut hopes By Reuters",
        "description": "European shares hit over 1-month high on earnings, Fed rate-cut hopes"
    },
    {
        "date": "2024-07-12",
        "title": "Why Intel Stock Popped on Friday",
        "description": "Intel has a software business now -- but its stock still costs too much."
    },
    {
        "date": "2024-07-12",
        "title": "AMD: Long-Term Implications Of The Silo AI Acquisition",
        "description": "Investors are slowly realizing that the AMD synergies from Silo AI represent long-term upside potential. Find out why I'm recommending a Buy on AMD stock."
    },
    {
        "date": "2024-07-12",
        "title": "AI Chip Stock Sell-Off Was 'Wake-Up Call,' Analyst Says",
        "description": "Nvidia stock and other AI chip stocks rebounded Friday after Thursday's brutal sell-off, which one analyst described as a"
    },
    {
        "date": "2024-07-12",
        "title": "Meta dips as analysts point to ongoing weakness in e-commerce ads (NASDAQ:META)",
        "description": "Meta Platforms stock (META) was one of the top movers to the downside in Communication Services Friday, -1.7%, after Edgewater Research pointed to some ongoing elements of weakness."
    },
    {
        "date": "2024-07-12",
        "title": "Top Stock Movers Now: Nvidia, Apple, Home Depot, Wells Fargo, and More",
        "description": "The S&P 500 and Nasdaq bounced back at midday after yesterday's selloff as tech stocks rallied."
    },
    {
        "date": "2024-07-12",
        "title": "Citi Shutters Unused Credit Card Accounts With Losses Soaring",
        "description": "(Bloomberg) -- Citigroup Inc. is shuttering unused credit card accounts as a growing number of customers fall behind on their payments. Most Read from BloombergBiden Vows to Stay in 2024 Race Even as NATO Gaffes Risk His CampaignBiden’s Putin-Zelenskiy Gaffe Deals Fresh Blow to CampaignJPMorgan Notches Record Profit on Visa Gain, Dealmaking JumpTesla Delays Robotaxi Event in Blow to Musk’s Autonomy DriveFCC Says It’s Investigating Massive Breach of AT&T Customer DataThe bank has also increased i"
    },
    {
        "date": "2024-07-12",
        "title": "What the 2000's Tech bubble says about today’s suspected rotation - analyst (NYSEARCA:XLK)",
        "description": "We are not at the start of a great rotation, but details from the leading to the 2000 tech bubble burst, may shine a light on what’s happening today - DB"
    },
    {
        "date": "2024-07-12",
        "title": "Want to Own NVIDIA? Buy These ETFs",
        "description": "These are some of the hottest ETFs this year thanks to AI."
    },
    {
        "date": "2024-07-12",
        "title": "S&P 500: CPI Led to Profit Taking - Is the Top In?",
        "description": ""
    },
    {
        "date": "2024-07-12",
        "title": "Leon Black Oversees $1B Wealth Shift For Apollo Fortune",
        "description": "The Apollo co-founder has sold or gifted 9.1 million shares of his multibillion-dollar stake since January."
    },
    {
        "date": "2024-07-12",
        "title": "Apple’s antitrust investigation reveals exploitation for market dominance: Report",
        "description": "The Competition Commission of India (CCI) has found that Apple exploited its dominant position in the market for app stores on its iOS operating system, engaging in abusive conduct and practices, reported Reuters."
    },
    {
        "date": "2024-07-12",
        "title": "America's 10 Best states for getting a job in the AI boom rather than being replaced by it",
        "description": "Artificial intelligence is going to transform the economy and job market, and these 10 states are leading the AI boom, and education and career opportunities."
    },
    {
        "date": "2024-07-12",
        "title": "Nasdaq Surges 1%; JPMorgan Posts Upbeat Earnings - JPMorgan Chase (NYSE:JPM)",
        "description": ""
    },
    {
        "date": "2024-07-12",
        "title": "U.S. Inflation Drop Paves Way For Federal Reserve Rate Cuts: Will Cannabis Stocks Benefit? - NVIDIA (NASDAQ:NVDA), iShares Russell 2000 ETF (ARCA:IWM)",
        "description": "The recent drop in U.S. inflation has sparked discussions about potential interest rate cuts by the U.S. Federal Reserve Bank. As inflation cools, investors are reconsidering their portfolios, with cannabis stocks emerging as a potential opportunity."
    },
    {
        "date": "2024-07-12",
        "title": "PDF Solutions: One Of The Scarcest Assets In The Semiconductor Industry",
        "description": "PDF Solutions is one of the scarcest assets in the Semicon industry. Click here for our investment thesis on PDFS stock."
    },
    {
        "date": "2024-07-12",
        "title": "JPMorgan Chase & Co. (JPM) Q2 2024 Earnings Call Transcript",
        "description": "JPMorgan Chase & Co. (NYSE:NYSE:JPM) Q2 2024 Earnings Conference Call July 12, 2024 8:30 AM ETCompany ParticipantsJeremy Barnum - CFOConference Call..."
    },
    {
        "date": "2024-07-12",
        "title": "How Apple Is Capitalizing On Its Balance Sheet To Drive AI Growth (NASDAQ:AAPL)",
        "description": "Apple presents a compelling investment thesis with a strong brand, financial health, and promising AI platform. Read why AAPL stock is a hold."
    },
    {
        "date": "2024-07-12",
        "title": "The Zacks Analyst Blog Highlights AMD, NVIDIA, Microsoft and Alphabet",
        "description": "AMD, NVIDIA, Microsoft and Alphabet are part of the Zacks top Analyst Blog."
    },
    {
        "date": "2024-07-12",
        "title": "JPMorgan Tops Earnings Estimates on Investment Banking Surge",
        "description": "JPMorgan Chase saw its earnings and revenue rise in the second quarter, beating estimates. It was led by an increase in investment banking."
    },
    {
        "date": "2024-07-12",
        "title": "JPMorgan, Citigroup, Wells Fargo Boast Better-Than-Expected Q2 Results - Citigroup (NYSE:C), JPMorgan Chase (NYSE:JPM)",
        "description": "Three major U.S. banks — JPMorgan, Citigroup, and Wells Fargo — reported better-than-expected Q2 earnings; market reactions were negative."
    },
    {
        "date": "2024-07-12",
        "title": "Buying the dip on a cheap stock? Don't do it 'just because the price has gone down,' says investing chief",
        "description": "A prominent stock taking a dive could look like a big buying opportunity, but tread carefully, say investing pros."
    },
    {
        "date": "2024-07-12",
        "title": "Downgrade Alert: AMD’s Uphill Battle Against Nvidia Is Getting Much Steeper (NASDAQ:AMD)",
        "description": "Analyzing Advanced Micro Devices, Inc.'s position in the AI race with Nvidia and whether it can challenge NVDA's market dominance. Click here for an AMD update."
    },
    {
        "date": "2024-07-12",
        "title": "Why A Magnificent 7 Breather Could Be A Good Thing For The Stock Market",
        "description": "Following prior instances like Thursday’s rotation out of the biggest stocks and into smaller ones, the S&P 500 has gained as the biggest names slumped, according to UBS research."
    },
    {
        "date": "2024-07-12",
        "title": "U.S. Stocks Moving Back To The Upside After Yesterday's Sell-Off",
        "description": "Stocks have moved mostly higher during trading on Friday, regaining ground following the substantial downturn seen over the course of the previous session. The major averages have all moved to the upside, with the Dow closing in on its record highs."
    },
    {
        "date": "2024-07-12",
        "title": "AMD: Building An AI Ecosystem (NASDAQ:AMD)",
        "description": "I am bullish on Advanced Micro Devices, Inc. stock, with potential for growth in AI market despite lagging Nvidia Corporation. Click for my AMD stock update."
    },
    {
        "date": "2024-07-12",
        "title": "Stock Market Today: Dow Jones, Nasdaq Rise Despite Inflation Surprise; Banks Lower After Earnings (Live Coverage)",
        "description": "The Dow and S&P 500 rose on the stock market today. Several banks reported results as a new earnings season got underway."
    },
    {
        "date": "2024-07-12",
        "title": "CCI antitrust probe finds Apple abused position in apps market: Report",
        "description": "The Indian investigation report comes as Apple faces increased antitrust scrutiny in other regions"
    },
    {
        "date": "2024-07-12",
        "title": "Wall Street closes higher on bets for Fed rate cut",
        "description": "Wall Street closed higher on Friday, with the S&P 500 and Dow Jones Industrial Average hitting intraday record highs, on bets that the US Federal Reserve (Fed) will cut interest rates in September, while big banks fell after reporting mixed results."
    },
    {
        "date": "2024-07-12",
        "title": "Stocks Show Mixed Reactions To June Producer Inflation Data - Direxion Daily AMZN Bull 2X Shares (NASDAQ:AMZU), Amazon.com (NASDAQ:AMZN)",
        "description": "Markets react to June PPI rising 0.2% MoM, exceeding forecasts. Annual surge in headline number and core PPI also beat expectations."
    },
    {
        "date": "2024-07-12",
        "title": "IXN: A Global Fund Concentrated In U.S. Tech",
        "description": "iShares Global Tech ETF offers global tech exposure, but is heavily weighted towards US stocks. Read more to see our analysis on IXN ETF."
    },
    {
        "date": "2024-07-12",
        "title": "Apple shares climb on report Foxconn factories ramp-up hiring ahead of iPhone 16 launch By Investing.com",
        "description": "Apple shares climb on report Foxconn factories ramp-up hiring ahead of iPhone 16 launch"
    },
    {
        "date": "2024-07-12",
        "title": "Stock Market Shifts Toward Small Caps After Tame CPI; JPMorgan, Taiwan Semi, Tesla In Focus: Weekly Review",
        "description": "Small caps and much of the market soared on tame CPI inflation data, while the extended Nasdaq sold off. JPMorgan and Tesla were in focus."
    },
    {
        "date": "2024-07-12",
        "title": "Amazon must comply with US agency's pregnancy bias probe, judge rules By Reuters",
        "description": "Amazon must comply with US agency's pregnancy bias probe, judge rules"
    },
    {
        "date": "2024-07-12",
        "title": "Stock Market Today: Dow Jones Rises On Hot Inflation Data; Tesla Downgraded To Sell",
        "description": "Stock Market Today; The Dow Jones rose Friday on hot inflation data. Tesla stock was downgraded to a sell rating."
    },
    {
        "date": "2024-07-12",
        "title": "Tesla (TSLA) Falls 8% on Robotaxi Event Delay: Buy the Dip?",
        "description": "Tesla (TSLA) pushes back its much-awaited Robotaxi event by two months, which triggers an 8% decline in its stock price. Does that present a buying opportunity for investors?"
    },
    {
        "date": "2024-07-12",
        "title": "Despite Market Challenges, Tesla Is Poised for Another Growth Phase",
        "description": "Tesla Inc. (TSLA) had a challenging start to 2024, with its shares depreciating by 20% year to date at the time of writing. This decline was driven by weak busi"
    },
    {
        "date": "2024-07-12",
        "title": "DocuSign: Navigating Through Volatility Toward Long-Term Growth",
        "description": "DocuSign Inc. (DOCU) has revolutionized the way businesses handle agreements, transitioning from paper-based processes to electronic signatures. Founded in 2003"
    },
    {
        "date": "2024-07-12",
        "title": "The Rise of BYOD and Enterprise Mobility Market: A $133.9 billion Industry Dominated by Tech Giants - Microsoft Corporation, Inc. and Cisco Systems | MarketsandMarkets™",
        "description": "Chicago, July  12, 2024  (GLOBE NEWSWIRE) -- The global BYOD and Enterprise Mobility Market size is projected to grow from USD 72.7 billion in 2024 to USD..."
    },
    {
        "date": "2024-07-12",
        "title": "US stocks are higher in early trading. Yields steepen across the curve. Dollar lower.",
        "description": "Modest gains for the three major indices. Russell 2000 continues its run with a gain of 1% in early trading"
    },
    {
        "date": "2024-07-12",
        "title": "Dow Jumps 100 Points; Producer Inflation Surpasses Expectations For June - Shineco (NASDAQ:SISI)",
        "description": ""
    },
    {
        "date": "2024-07-13",
        "title": "Elon Musk says he fully endorses \"tough\" Trump, posts photo By Reuters",
        "description": "Elon Musk says he fully endorses \"tough\" Trump, posts photo"
    },
    {
        "date": "2024-07-13",
        "title": "Elon Musk says he fully endorses Donald Trump following apparent shooting (NASDAQ:TSLA)",
        "description": "Elon Musk shows support for President Trump after rally scare."
    },
    {
        "date": "2024-07-13",
        "title": "Is Upstart Stock a Buy?",
        "description": "The last couple of years have been painful. Is the worst over?"
    },
    {
        "date": "2024-07-13",
        "title": "Is It Too Late to Buy Nvidia Stock After Its 10-for-1 Split?",
        "description": "Nvidia stock is up nearly 800% over the last 18 months."
    },
    {
        "date": "2024-07-13",
        "title": "Want Decades of Passive Income? 3 Stocks to Buy Right Now",
        "description": "Who says dividend investors can't beat the market?"
    },
    {
        "date": "2024-07-13",
        "title": "Down 30% From Its 52-Week High, Is Now the Time to Buy Ulta Beauty Stock?",
        "description": "Shares of Ulta Beauty deserve a closer look following the deep sell-off."
    },
    {
        "date": "2024-07-13",
        "title": "Jefferies says AI is already a bubble. But the bubble will likely get bigger By Investing.com",
        "description": "Jefferies says AI is already a bubble. But the bubble will likely get bigger"
    },
    {
        "date": "2024-07-13",
        "title": "The Smartest Dividend Stocks to Buy With $600 Right Now",
        "description": "Several stellar dividend stocks are trading at low prices you rarely see."
    },
    {
        "date": "2024-07-13",
        "title": "US Banks Sound Alarm On Lower-Income Struggles Before Election - Citigroup (NYSE:C), Bank of New York Mellon (NYSE:BK)",
        "description": "Financial giants warn of lower-income woes pre-election, amid depleted stimulus impact and inflation fears."
    },
    {
        "date": "2024-07-13",
        "title": "Is It Time to Buy 2024's Worst-Performing S&P 500 Stocks?",
        "description": "Markets are racing higher, but some stocks are trading at fire-sale prices."
    },
    {
        "date": "2024-07-13",
        "title": "Where Will Broadcom Stock Be in 10 Years?",
        "description": "Should you bet on this exciting artificial intelligence stock?"
    },
    {
        "date": "2024-07-13",
        "title": "Dimon For President? Financial Circles Navigate Biden-Trump Dilemma - JPMorgan Chase (NYSE:JPM)",
        "description": "The idea of Jamie Dimon running for president has become popular in financial circles, akin to a trend gaining momentum."
    },
    {
        "date": "2024-07-13",
        "title": "Global AC Power Sources Market Size To Worth USD 1.81 Billion By 2033 l CAGR Of 4.64%",
        "description": "The Global AC Power Sources Market Size was Valued at USD 1.15 Billion in 2023 and the Worldwide AC Power Sources Market Size is Expected to Reach USD 1.81..."
    },
    {
        "date": "2024-07-13",
        "title": "Notable analyst calls this week: Apple, Tesla and banks among top picks",
        "description": "The S&P500 (SP500) closed in the green/red on Friday, after investors digested quarterly results from big banks and data showing consumer prices cooling down in"
    },
    {
        "date": "2024-07-13",
        "title": "CPI Deflationary; Full-Time Employment Swoons; Housing In The Dumpster – Could The Fed Be Any Further “Behind The Curve”?",
        "description": "Signs of a cooling economy are emerging. Our analysis reveals that employment is weakening as seen in the spikes in Initial and Continuing Employment Claims."
    },
    {
        "date": "2024-07-13",
        "title": "Is Super Micro Computer Stock a Good Buy Right Now?",
        "description": "Shares of Super Micro Computer are up over 200% so far this year."
    },
    {
        "date": "2024-07-13",
        "title": "SharkNinja Stock: A Consumer Goods Outlier As Growth Accelerates (NYSE:SN)",
        "description": "Discover why SharkNinja is poised for success with its strong growth and market share, making it a bullish stock pick for investors."
    },
    {
        "date": "2024-07-13",
        "title": "Apple's Getting Ahead Of Itself (NASDAQ:AAPL)",
        "description": "Apple's shares skyrocketed due to Apple Intelligence launch."
    },
    {
        "date": "2024-07-13",
        "title": "History Says These Could Be 3 of the Best Healthcare Stocks to Own in the Second Half of 2024",
        "description": "These are solid stocks that have all generated 10-year returns in excess of 200%."
    },
    {
        "date": "2024-07-13",
        "title": "Nasdaq 100 post-ChatGPT has gained more than after any other major tech event since 1974",
        "description": "The Nasdaq 100 (NDX) has gained more in over 400 days than in the aftermath of any other major technological release of the last half-century. Read more here."
    },
    {
        "date": "2024-07-13",
        "title": "Stock-Split Watch: Is Microsoft Next?",
        "description": "The split for Microsoft could come at a lower price than comparable stocks."
    },
    {
        "date": "2024-07-13",
        "title": "Why Super Micro Computer Stock Had a Super Massive 188% Gain in the 1st Half of 2024",
        "description": "Demand has skyrocketed beyond belief."
    },
    {
        "date": "2024-07-13",
        "title": "EV maker VinFast slashes full-year sales target by 20% as U.S. factory is delayed",
        "description": "VinFast Auto said it will delay the opening of its electric vehicle factory in North Carolina by three years to 2028."
    },
    {
        "date": "2024-07-13",
        "title": "The second half — Greater Fool – Authored by Garth Turner – The Troubled Future of Real Estate",
        "description": ""
    },
    {
        "date": "2024-07-13",
        "title": "With Shares Down 42%, Is Now the Time to Buy This Restaurant Stock?",
        "description": "The Starbucks of yesteryear may not be equipped to serve the customer of the future ... or even the customer of the present."
    },
    {
        "date": "2024-07-13",
        "title": "Laurene Powell Jobs buys mansion on San Francisco’s Billionaire’s Row for $70 million, a record high for the city",
        "description": "The sellers of the San Francisco mansion bought the home in 2011 for $33 million."
    },
    {
        "date": "2024-07-13",
        "title": "Inflation Relief Spurs Rotation From Tech To Laggards",
        "description": "Better-than-expected inflation numbers paved the way for the Fed to cut rates later this year, prompting a massive rotation in the stock market."
    },
    {
        "date": "2024-07-13",
        "title": "1 Soaring Growth Stock to Buy and Hold for 10 Years",
        "description": "There is still much growth left in this red-hot cybersecurity stock."
    },
    {
        "date": "2024-07-13",
        "title": "Top Contributor of ClearBridge Sustainability Leaders Strategy: Microsoft Corporation (MSFT)",
        "description": "ClearBridge Investments, an investment management company, released its “ClearBridge Sustainability Leaders Strategy” second quarter 2024 investor letter."
    },
    {
        "date": "2024-07-13",
        "title": "The More One Understands What Amazon Truly Is About, The Better It Looks (NASDAQ:AMZN)",
        "description": "Discover the true value of investing in Amazon (AMZN) stock and how sticking to the long-term vision pays off for shareholders in the end. Explore more here."
    },
    {
        "date": "2024-07-13",
        "title": "Apple, Nvidia, Palantir, MicroStrategy And Shiba Inu's Ambitious Trillion-Dollar Vision: Benzinga Bulls And Bears",
        "description": "Benzinga examined the prospects for many investors’ favorite stocks over the last week — here’s a look at some of our top stories. The Dow led the market with a 1.6% weekly gain, while a sharp sell-off in tech stocks limited the Nasdaq’s increase to 0.2%, and the S&P 500 rose by 0.9%."
    },
    {
        "date": "2024-07-13",
        "title": "This ‘Corporate Raider’ Is Urging Us To Buy These 8%+ Paying Funds Now",
        "description": "Ackman aims to launch a new CEF that will have $25 billion in assets under management, raised from investors like you and me."
    },
    {
        "date": "2024-07-13",
        "title": "How professional investors are gearing up for the presidential election",
        "description": "Three Wall Street investors told CNBC Pro that diversification remains key in the months before the U.S. presidential election."
    },
    {
        "date": "2024-07-13",
        "title": "Meta Platforms Stock: Likely To Become A Strong Dividend Grower",
        "description": "Meta Platforms shows strong potential for dividend growth despite risks, with Q1 earnings beating expectations. See why we recommend a buy on META stock."
    },
    {
        "date": "2024-07-13",
        "title": "Dow Jones Futures: Market Rally Powers Up; Four Stocks In Buy Zones",
        "description": "Dow Jones futures: Fed rate-cut hopes fueled a broader market rally, with many stocks in buy areas. But earnings loom for a stretched Nasdaq."
    },
    {
        "date": "2024-07-13",
        "title": "Got $1,000? 2 Stocks to Buy Now While They're On Sale",
        "description": "Here are two timely buys that can grow your money."
    },
    {
        "date": "2024-07-13",
        "title": "Stock-Split Watch: MicroStrategy Is Next",
        "description": "MicroStrategy's soaring share price resulted in a 10-for-1 stock split. Here's what you need to know."
    },
    {
        "date": "2024-07-13",
        "title": "3 High-Yielding Dividend Stocks Near Their 52-Week Lows",
        "description": "These stocks all yield more than 3%."
    },
    {
        "date": "2024-07-13",
        "title": "3 Stocks I'm Buying As We Close In On Fed Rate Cuts",
        "description": "A mild recession like the one in the early 2000s could be very good for the beaten down real estate sector. Read more on the macroeconomy here."
    },
    {
        "date": "2024-07-13",
        "title": "Dow Jones Giants And Tesla Archrival Lead Five Stocks Near Buy Points",
        "description": "Dow Jones: Amazon.com and JPMorgan Chase lead a Group of Five stocks to keep tabs on this week amid market role reversal."
    },
    {
        "date": "2024-07-13",
        "title": "3 Red-Hot Growth Stocks to Buy in 2024 and Beyond",
        "description": "These stocks have been beating the market so far this year, and they could keep right on beating it."
    },
    {
        "date": "2024-07-13",
        "title": "3 Hyper-Growth Stocks That Are Screaming Buys Right Now",
        "description": "These growing companies can help you build lasting wealth."
    },
    {
        "date": "2024-07-13",
        "title": "Apple's iPhone looks like it's on the rebound. What does that mean for suppliers?",
        "description": "A number of Wall Street firms in recent days have upped their estimates for Apple's (AAPL) iPhone, citing stabilization in regions like China and even in the U."
    },
    {
        "date": "2024-07-13",
        "title": "This Deeply Discounted CEF Mini-Portfolio Yields 9.2%",
        "description": "With the market at nosebleed valuations, where can we look for value and yield? Let’s turn to our favorite three-letter acronym. C-E-Fs."
    },
    {
        "date": "2024-07-13",
        "title": "Why I Sold These 7 Stocks: A Stock Portfolio Spring Cleaning",
        "description": "I closed out five stock holdings and took profits on two more this week. Here's why I parted ways with these stocks."
    },
    {
        "date": "2024-07-13",
        "title": "An ‘Imminent’ Stock Market ‘Correction’ Warning Suddenly Flashed Red—Just As The S&P 500, The Dow And The Nasdaq Hit Record Highs",
        "description": "One analyst has pointed to a surprise stock market warning like that's just begun flashing red..."
    },
    {
        "date": "2024-07-13",
        "title": "2 Stocks That Could Turn $1,000 Into $5,000 by 2030",
        "description": "Expect the upsurge in these consumer stocks to continue."
    },
    {
        "date": "2024-07-13",
        "title": "It Takes A Huge Setback To Make A Massive Comeback",
        "description": "Learn the importance of overcoming hardships in Riches-to-riches stories and why diversifying investments is crucial, with top real estate options. Click for more."
    },
    {
        "date": "2024-07-13",
        "title": "MDB INVESTOR NOTICE: MongoDB, Inc. (Nasdaq:MDB) Shareholders that Incurred Losses are Urged to Contact BFA Law about Upcoming Legal Deadline",
        "description": "MongoDB investors that suffered losses in their investment are encouraged to contact BFA Law before the September 9, 2024 Court deadline...."
    },
    {
        "date": "2024-07-13",
        "title": "ELANCO INVESTOR NOTICE: Elanco (NYSE:ELAN) Shareholders that Incurred Losses are Urged to Contact BFA Law about Investigation into the Company for Securities Fraud",
        "description": "Elanco investors that suffered losses in their investment are encouraged to contact BFA Law about their rights...."
    },
    {
        "date": "2024-07-13",
        "title": "GL INVESTOR NOTICE: Long-term Shareholders of Globe Life Inc. (NYSE:GL) are Notified to Contact BFA Law about Ongoing Investigation into the Company",
        "description": "Globe Life Shareholders are encouraged to contact BFA Law about its investigation into the Board for breaches of fiduciary duties...."
    },
    {
        "date": "2024-07-13",
        "title": "SALESFORCE INVESTOR NOTICE: Salesforce, Inc. (NYSE:CRM) Shareholders that Incurred Losses are Urged to Contact BFA Law about Securities Fraud Investigation",
        "description": "Salesforce, Inc. investors that suffered losses in their investment are encouraged to contact BFA Law about their rights...."
    },
    {
        "date": "2024-07-13",
        "title": "Forget Apple: Consider These 2 Millionaire-Maker Stocks Instead",
        "description": "These companies have more growth potential and are trading at better values than Apple."
    },
    {
        "date": "2024-07-13",
        "title": "CAE INVESTOR NOTICE: CAE, Inc. (NYSE:CAE) Shareholders that Incurred Losses are Urged to Contact BFA Law about Investigation into the Company for Securities Fraud",
        "description": "CAE, Inc. investors that suffered losses in their investment are encouraged to contact BFA Law about their rights...."
    },
    {
        "date": "2024-07-13",
        "title": "UIPATH INVESTOR NOTICE: UiPath, Inc. (NYSE:PATH) Shareholders that Incurred Losses are Urged to Contact BFA Law about Upcoming Securities Fraud Legal Deadline",
        "description": "UiPath, Inc. investors that suffered losses in their investment are encouraged to contact BFA Law before August 19, 2024 Court deadline...."
    },
    {
        "date": "2024-07-13",
        "title": "RCM INVESTOR NOTICE: R1 RCM Inc. (NASDAQ:RCM) Shareholders are Notified to Contact BFA Law about Investigation into the $13.25 Per Share Offer",
        "description": "R1 RCM Shareholders are encouraged to contact BFA Law about their rights relating to the upcoming merger...."
    },
    {
        "date": "2024-07-13",
        "title": "PARA INVESTOR NOTICE: Paramount Global (Nasdaq:PARA) Shareholders are Notified to Contact BFA Law about Investigation into the Company’s Acquisition Price",
        "description": "Paramount Global Shareholders are encouraged to contact BFA Law about their rights relating to the upcoming merger...."
    },
    {
        "date": "2024-07-13",
        "title": "TERADATA INVESTOR NOTICE: Teradata Corp. (NYSE:TDC) Shareholders that Incurred Losses are Urged to Contact BFA Law about Upcoming Legal Deadline",
        "description": "Teradata Corp. investors that suffered losses in their investment are encouraged to contact BFA Law before the August 13, 2024 Court deadline...."
    },
    {
        "date": "2024-07-13",
        "title": "RPD INVESTOR NOTICE: Rapid7, Inc. (Nasdaq:RPD) Shareholders are Notified to Contact BFA Law about Investigation into the Company’s Acquisition Price",
        "description": "Rapid7 Shareholders are encouraged to contact BFA Law about its investigation into potential claims for breach of fiduciary duty against Rapid7, Inc...."
    },
    {
        "date": "2024-07-13",
        "title": "Is Micron Technology Stock a Buy Now?",
        "description": "The memory specialist's stock price has been heading south of late."
    },
    {
        "date": "2024-07-13",
        "title": "Will Broadcom Stock Soar After Its 10-for-1 Stock Split? Here's What History Shows.",
        "description": "History isn't necessarily a great guide for investors with Broadcom's recent stock split."
    },
    {
        "date": "2024-07-13",
        "title": "6 Artificial Intelligence (AI) Stocks Inside Warren Buffett's $410 Billion Portfolio",
        "description": "At least six companies in Berkshire Hathaway's portfolio are now benefiting from artificial intelligence (AI)."
    },
    {
        "date": "2024-07-13",
        "title": "SoftBank Missed Out On $160 Billion in Gains With Artificial Intelligence (AI) Leader Nvidia -- but Its Regret Will Likely Be Short-Lived",
        "description": "Although nobody's ever gone broke taking a profit, hindsight doesn't always paint the prettiest picture on Wall Street."
    },
    {
        "date": "2024-07-13",
        "title": "2 Unloved Stocks to Buy Right Now",
        "description": "Intel and Paycom are both going through painful transitions that should pay off in the long run."
    },
    {
        "date": "2024-07-13",
        "title": "Is It Finally Time to Sell Nvidia Stock?",
        "description": "Should investors consider booking profits following this recent analyst action?"
    },
    {
        "date": "2024-07-13",
        "title": "Weekly Commentary: Houston, We Have A Bubble Problem",
        "description": "The current Bubble dwarfs mortgage finance Bubble excess. For starters, home prices have inflated about 50% since the pandemic. Read more here."
    },
    {
        "date": "2024-07-13",
        "title": "3 Stock-Split Stocks to Buy Hand Over Fist Before They Soar By as Much as 100%, According to Select Wall Street Analysts",
        "description": "Companies that perform stock splits are usually firing on all cylinders."
    },
    {
        "date": "2024-07-13",
        "title": "Will the selloff in Nvidia, chip stocks extend? By Investing.com",
        "description": "Will the selloff in Nvidia, chip stocks extend?"
    },
    {
        "date": "2024-07-13",
        "title": "What should investors do with tech stocks after a 21.5% H1 rally? By Investing.com",
        "description": "What should investors do with tech stocks after a 21.5% H1 rally?"
    },
    {
        "date": "2024-07-13",
        "title": "Black Coffee: Something Borrowed, Something Blue",
        "description": "It’s time to sit back, relax and enjoy a little joe … Welcome to another rousing edition of Black Coffee, your off-beat weekly round-up of what’s been going on in the world of money and personal finance. I hope everybody had an enjoyable week. Without further ado, let’s get right to this week’s commentary … […]"
    },
    {
        "date": "2024-07-13",
        "title": "Tesla's Resurgence Is Great News for These 3 Growth Stocks",
        "description": "Improving delivery data from Elon Musk's company suggests the worst may be over for the EV market."
    },
    {
        "date": "2024-07-13",
        "title": "Analyst Ups Apple's Price Target To $256, Says New AI Features Will Encourage Users To Upgrade To Newer iPhones: 'People Were Looking For A Real Reason...' - Apple (NASDAQ:AAPL)",
        "description": "Bank of America Securities analyst Wamsi Mohan has increased his price target for Apple from $230 to $256, citing the potential for an upgrade cycle driven by new AI features."
    },
    {
        "date": "2024-07-13",
        "title": "Wall Street’s broadening trade pressures index-tracking billions",
        "description": "Such a broadening in the winners list has been sought for years by market skeptics lamenting an equity melt-up whose momentum has been generated by a tiny cohort of asset-light firms. But its a less obvious blessing in the short term for passively managed investors. Theyve stashed one in every four ETF dollars in just five funds — products that are now perilously exposed to the fate of the Magnificent 7."
    },
    {
        "date": "2024-07-13",
        "title": "Wall Street Week Ahead: Expected US rate cuts have investors looking beyond big tech",
        "description": "Looming U.S. interest rate cuts are challenging investors to choose between continuing to invest in high-performing Big Tech stocks or diversifying into less favored market areas that could benefit from easing monetary policy. Recent market movements suggest a potential shift, as small caps and economically sensitive sectors show gains amid expectations of lower rates, while tech stocks face declines reminiscent of the late 1990s dot-com bubble."
    },
    {
        "date": "2024-07-13",
        "title": "As Tesla CEO Elon Musk Wants To 'Obliterate' Short Sellers, Expert Says They Are Important 'More Than Ever' To Keep Frauds Out Of The Market - Tesla (NASDAQ:TSLA)",
        "description": "Muddy Waters founder Carson Block believes short sellers are crucial for curbing market fraud, but the current speculative frenzy makes their job difficult."
    }
]