[
    {
        "date": "2024-08-15",
        "title": "Penumbra executive sells over $105k in company stock By Investing.com",
        "description": "Penumbra executive sells over $105k in company stock"
    },
    {
        "date": "2024-08-15",
        "title": "Campaign Hacks Blamed on Iran Draw FBI Investigation of Election Interference Risks",
        "description": "Suspected attempts by Iranian hackers to infiltrate US presidential campaigns have touched off a widening federal investigation into the first major effort by a foreign actor to disrupt the November election."
    },
    {
        "date": "2024-08-15",
        "title": "Billionaire Paul Singer Says He’s Staying Away from Apple (AAPL) and Other AI Bubble Stocks",
        "description": "We recently published a list of Billionaire Paul Singer Says Stay Away from These 7 AI Bubble Stocks; 3 Tech Stocks He’s Buying. Since Apple Inc (NASDAQ:AAPL) ranks 6th on the list, it deserves a ..."
    },
    {
        "date": "2024-08-15",
        "title": "Is Amazon.com Inc (NASDAQ:AMZN) Cathie Wood’s Favorite AI Stock?",
        "description": "Cathie Wood’s flagship fund is continuing to face steep losses amid a broader pullback in technology stocks."
    },
    {
        "date": "2024-08-15",
        "title": "Is Alphabet Inc. (NASDAQ:GOOG) Cathie Wood’s Favorite AI Stock?",
        "description": "Cathie Wood’s flagship fund is continuing to face steep losses amid a broader pullback in technology stocks."
    },
    {
        "date": "2024-08-15",
        "title": "Is Meta Platforms Inc (NASDAQ:META) Cathie Wood’s Favorite AI Stock?",
        "description": "Cathie Wood’s flagship fund is continuing to face steep losses amid a broader pullback in technology stocks."
    },
    {
        "date": "2024-08-15",
        "title": "Grab Holdings Limited (GRAB): Leading the Charge Among Top Technology Penny Stocks",
        "description": "We recently compiled a list of the 10 Best Technology Penny Stocks to Invest in Now."
    },
    {
        "date": "2024-08-15",
        "title": "Is Microsoft Corp (NASDAQ:MSFT) the Best Stock to Buy According to Cathie Wood?",
        "description": "Cathie Wood’s flagship fund is continuing to face steep losses amid a broader pullback in technology stocks."
    },
    {
        "date": "2024-08-15",
        "title": "Is Tesla Inc (NASDAQ:TSLA) the Best Cathie Wood Stock to Buy?",
        "description": "Cathie Wood’s flagship fund is continuing to face steep losses amid a broader pullback in technology stocks."
    },
    {
        "date": "2024-08-15",
        "title": "Market Today: Walmart Eases Recession Worries, Nvidia Nears $3T Valuation, Kroger-Albertsons Deal",
        "description": "Stock Market PerformanceThe stock market registered solid gains in a broad advance. The Dow Jones Industrial Average rose 1.4%, the S&P 500 settled 1.6% higher,"
    },
    {
        "date": "2024-08-15",
        "title": "Warren Buffett Still Holds 400M Apple Shares, Reveals New Investments In Ulta Beauty And Heico — Elon Musk Calls Berkshire Hathaway's $277B Cash Reserves 'Wild'",
        "description": "Warren Buffett, the legendary investor, has disclosed significant stock sales by Berkshire Hathaway Inc. (NYSE:BRK) (NYSE:BRK) in the second quarter, including a substantial reduction in its Apple Inc. (NASDAQ:AAPL) holdings. What Happened: Buffett's ..."
    },
    {
        "date": "2024-08-15",
        "title": "Philippe Laffont's Coatue Management ups Nvidia stake by nearly tenfold (NASDAQ:NVDA)",
        "description": "Philippe Laffont's Coatue Management released its latest 13F filing. Read here to see its equity ownership moves in Q2."
    },
    {
        "date": "2024-08-15",
        "title": "Wall Street rallies to one of its best days of the year",
        "description": "The S&P 500 jumped 1.6% for its fourth-best day of the year and its sixth straight gain as the U.S. stock market rights itself following a scary few weeks."
    },
    {
        "date": "2024-08-15",
        "title": "VICOR SHAREHOLDER ALERT: CLAIMSFILER REMINDS INVESTORS WITH LOSSES IN EXCESS OF $100,000 of Lead Plaintiff Deadline in Class Action Lawsuit Against Vicor Corporation - VICR",
        "description": "NEW ORLEANS, Aug.  15, 2024  (GLOBE NEWSWIRE) -- ClaimsFiler, a FREE shareholder information service, reminds investors that they have until September 23,..."
    },
    {
        "date": "2024-08-15",
        "title": "Zero Trust Security Market to Grow at CAGR of 18.50% through 2033 - Securing the Modern IT Landscape",
        "description": "The zero trust security market is rapidly expanding as organizations increasingly prioritize cybersecurity in response to growing threats from internal..."
    },
    {
        "date": "2024-08-15",
        "title": "Dow Jones Futures: Stock Market Sends Clear Message; Nvidia, Meta, Tesla Lead New Buys",
        "description": "Dow Jones futures: The major indexes cleared key levels in a strong day for the stock market. Nvidia and arguably Tesla flashed buy signals."
    },
    {
        "date": "2024-08-15",
        "title": "George Soros’ firm dumped $73 million in Alphabet and Amazon before the July nosedive",
        "description": "Ultra-wealthy family offices cashed out holdings in Mag 7 stocks before the market downturn."
    },
    {
        "date": "2024-08-15",
        "title": "Apple continues gains for seven straight sessions (NASDAQ:AAPL)",
        "description": "AAPL shares rise for seventh straight session, gaining 15% this year."
    },
    {
        "date": "2024-08-15",
        "title": "The Federal Reserve Won't Save The Market From Its Fate",
        "description": "Investor hopes for coming cuts to Fed Funds rate are very likely to come to fruition at the September FOMC meeting. Click here to read my market outlook."
    },
    {
        "date": "2024-08-15",
        "title": "Jim Cramer’s Hottest 10 Stock Picks",
        "description": "In a recent episode of Mad Money, Jim Cramer talked about what he sees as Wall Street's biggest oversights this earnings season, especially on a day when the Dow dropped 141 points, and the NASDAQ advanced..."
    },
    {
        "date": "2024-08-15",
        "title": "Bill Ackman's Pershing Square Semiannual 2024 Letter: A Review",
        "description": "To the Shareholders of Pershing Square Holdings, Ltd.: 2024 has been a productive year for Pershing Square despite PSH's modest negative performance year-to-dat"
    },
    {
        "date": "2024-08-15",
        "title": "Crexendo CTO David Wang sells $12,500 in company stock By Investing.com",
        "description": "Crexendo CTO David Wang sells $12,500 in company stock"
    },
    {
        "date": "2024-08-15",
        "title": "Warren Buffett's Strategic Moves: A Deep Dive into Berkshire Hathaway's Latest 13F Filing",
        "description": "Highlighting Key Adjustments and the Impact on Apple Inc.\n\nWarren Buffett (Trades, Portfolio), often referred to as \"The Oracle of Omaha,\" is a towering figure"
    },
    {
        "date": "2024-08-15",
        "title": "Three New Pieces Of Data Trigger Aggressive Buying In Nvidia And AI Stocks - Apple (NASDAQ:AAPL)",
        "description": "To gain an edge, this is what you need to know today."
    },
    {
        "date": "2024-08-15",
        "title": "These Companies Are Shaping the Future of EV Charging and Energy Storage",
        "description": "Stocks Analysis by Dan Brdar covering: Renault SA, Tesla Inc, Siemens AG CEDEAR, Enphase Energy Inc. Read Dan Brdar's latest article on Investing.com"
    },
    {
        "date": "2024-08-15",
        "title": "Undercovered Dozen ETF Edition: Covered Call Funds, Small-Cap Value, Leveraged ETFs, Japan +",
        "description": "The Undercovered Dozen series highlights less-covered tickers on Seeking Alpha as another source of idea generation. Read what investors need to know."
    },
    {
        "date": "2024-08-15",
        "title": "Wall Street Just Got Its Most Volatile ETF as Risky Bets Boom",
        "description": "Defiance launched the Defiance Daily Target 1.75X Long MSTR ETF (MSTX), which looks to offer daily leveraged returns on MicroStrategy Inc."
    },
    {
        "date": "2024-08-15",
        "title": "Gamblers Are Dumping Stocks to Bet on Sports, New Study Says",
        "description": "A new study claims that for every dollar spent on sports gambling, net investments in stocks and other financial instruments dropped by just over $2."
    },
    {
        "date": "2024-08-15",
        "title": "Bill Ackman's Pershing Square takes new stake in Brookfield Corp. worth US$285 million",
        "description": "Bill Ackman’s Pershing Square Capital Management LP built a stake in Canadian investment management giant Brookfield Corp. Find out more."
    },
    {
        "date": "2024-08-15",
        "title": "Bill Ackman's Pershing Square takes new stake in Brookfield Corp. worth US$285 million",
        "description": "Bill Ackman’s Pershing Square Capital Management LP built a stake in Canadian investment management giant Brookfield Corp. Find out more."
    },
    {
        "date": "2024-08-15",
        "title": "Meta CEO Mark Zuckerberg receives letter from lawmakers concerned about illicit drug ads on Facebook and Instagram",
        "description": "A bipartisan group of lawmakers sent Meta CEO Mark Zuckerberg a letter expressing concern about illicit drug advertisements running on the company's apps."
    },
    {
        "date": "2024-08-15",
        "title": "There's More To The EV Story Than The Slowdown - Tesla (NASDAQ:TSLA)",
        "description": "The EV slowdown has been in the air since the year began."
    },
    {
        "date": "2024-08-15",
        "title": "What's Going On With Tesla Stock Today",
        "description": "Tesla shares are trading higher by 3.6% during Thursday’s session. The stock is up after strong retail sales, hinting at higher consumer demand and possible vehicle sales growth. Tesla Inc (NASDAQ:TSLA) shares are trading higher by 5.77% to $213 ..."
    },
    {
        "date": "2024-08-15",
        "title": "J.P. Morgan Asset Management Announces SmartRetirement Lifetime Income „ By Investing.com",
        "description": "J.P. Morgan Asset Management Announces SmartRetirement Lifetime Income „"
    },
    {
        "date": "2024-08-15",
        "title": "Glenview Capital's Q2 moves include selling Broadcom after just one quarter (NASDAQ:AVGO)",
        "description": "Larry Robbins' Glenview Capital Management released its latest 13F filing. Read here to see its equity ownership moves in Q2."
    },
    {
        "date": "2024-08-15",
        "title": "J.P. Morgan Asset Management Announces SmartRetirement Lifetime Income℠ - JPMorgan Chase (NYSE:JPM), Equitable Hldgs (NYSE:EQH)",
        "description": "-Solution offers an innovative lifetime income strategy providing transparency and flexibility to retirement savers- NEW YORK, Aug. 15, 2024 /PRNewswire/ -- J.P. Morgan Asset Management today announced a new retirement"
    },
    {
        "date": "2024-08-15",
        "title": "JPMorgan Chase: Covered Calls Can Help Navigate Fed Rate Cuts (NYSE:JPM)",
        "description": "JPMorgan Chase has outperformed the iShares U.S. Financials ETF in 2024 with a 24% total return. Click here to read an analysis of JPM stock now."
    },
    {
        "date": "2024-08-15",
        "title": "abrdn Silver ETF Trust switches custodians for silver holdings By Investing.com",
        "description": "abrdn Silver ETF Trust switches custodians for silver holdings"
    },
    {
        "date": "2024-08-15",
        "title": "Bitcoin ETF on Warren Buffett's Radar? Nate Geraci Says Bring It On By U.Today",
        "description": "Bitcoin ETF on Warren Buffett's Radar? Nate Geraci Says Bring It On"
    },
    {
        "date": "2024-08-15",
        "title": "Piper Sandler spotlights key technical levels for GOOGL, NFLX, CRWD, OKTA, and others",
        "description": "Piper Sandler highlighted key technical charts for stocks such as Alphabet (GOOGL) Netflix (NFLX), CrowdStrike (CRWD), Okta (OKTA), and others. Learn more here."
    },
    {
        "date": "2024-08-15",
        "title": "Invesco Summit Fund Q2 2024 Review",
        "description": "Invesco Summit Fund Class A shares at NAV had a positive return for the quarter (5.35%) and outpaced the\nMorningstar large-cap growth fund category average. Click here to read the full fund"
    },
    {
        "date": "2024-08-15",
        "title": "The Progressive Corporation (PGR): This Property and Casualty Insurance Stock Is a Good Addition to Your Portfolio Now",
        "description": "We recently compiled a list of the 10 Best Property & Casualty Insurance Stocks to Buy. In this article, we are going to take a look at where The Progressive Corporation (NYSE:PGR) stands against the..."
    },
    {
        "date": "2024-08-15",
        "title": "IUSG: A Growth ETF With An Impressive 12% IRR Potential (NASDAQ:IUSG)",
        "description": "The iShares Core S&P U.S. Growth seeks to replicate the S&P 900 Growth Index with 483 constituents and $18.6 billion in assets. Learn more on IUSG ETF here."
    },
    {
        "date": "2024-08-15",
        "title": "There's a buying opportunity developing in this big tech stock, according to the charts",
        "description": "David Keller breaks down the charts in Alphabet."
    },
    {
        "date": "2024-08-15",
        "title": "Stocks Continue to Rise Amid Strong Data",
        "description": ""
    },
    {
        "date": "2024-08-15",
        "title": "Nvidia maintains week-long rally as other semi stocks follow",
        "description": "Nividia continued its rally on Thursday as the leader of artificial intelligence chipmakers inches back above the $3T market valuation milestone. Read more here."
    },
    {
        "date": "2024-08-15",
        "title": "Wall Street Lunch: What? Recession Who?",
        "description": "Easing unemployment data, solid Walmart results indicate a strong consumer, lowering recession fears. Sirius XM rallies after Warren Buffett more than tripled his stake in the company in Q2."
    },
    {
        "date": "2024-08-15",
        "title": "What If Tesla Is No Longer A Growth Company? (NASDAQ:TSLA)",
        "description": "Tesla faces challenges from slowing sales and declining EPS projections, a result of increased competition in the EV space. See why I remain bearish on TSLA."
    },
    {
        "date": "2024-08-15",
        "title": "NewsWrap Ep 3 – Inside track on ructions at Comrades, Joburg, Tongaat; and why Buffett sold Apple.",
        "description": "In this episode of NewsWrap, editor Alec Hogg and the BizNews team provide context on the biggest stories of the past week."
    },
    {
        "date": "2024-08-15",
        "title": "Craig-Hallum are 'strong buyers of Lumentum stock'; PT raised to $70 By Investing.com",
        "description": "Craig-Hallum are 'strong buyers of Lumentum stock'; PT raised to $70"
    },
    {
        "date": "2024-08-15",
        "title": "Why Is Warren Buffett Buying More Sirius XM Stock?",
        "description": "Berkshire Hathaway is adding to its position in one of the biggest losers on its scorecard this year. It makes more sense than you think."
    },
    {
        "date": "2024-08-15",
        "title": "Klarna takes on JPMorgan Chase, Bank of America with bank accounts",
        "description": "Klarna Bank AB is adding retail-banking services in the US and across much of Europe, expanding beyond its signature buy-now, pay-later offering as the fintech prepares for an initial public offering."
    },
    {
        "date": "2024-08-15",
        "title": "Swedish EV maker Polestar starts U.S. production, avoiding heavy tariffs By Reuters",
        "description": "Swedish EV maker Polestar starts U.S. production, avoiding heavy tariffs"
    },
    {
        "date": "2024-08-15",
        "title": "Alphabet (GOOGL) Boosts Smartwatch Offerings With Pixel Watch 3",
        "description": "Alphabet's (GOOGL) Google launches Pixel Watch 3 with advanced features and improved designs, which intensifies competition."
    },
    {
        "date": "2024-08-15",
        "title": "Why Tesla, Lucid, and Toyota Motors Stocks Raced Higher Today",
        "description": "Auto sales roar, Cybertruck sales soar, and three car companies debate which of them is best."
    },
    {
        "date": "2024-08-15",
        "title": "More evidence of late cycle iPhone strength: Morgan Stanley By Investing.com",
        "description": "More evidence of late cycle iPhone strength: Morgan Stanley"
    },
    {
        "date": "2024-08-15",
        "title": "What's Driving Tesla Inc's Surprising 13% Stock Rally?",
        "description": "Tesla Inc (TSLA), a leader in the electric vehicle industry, has seen a notable increase in its stock price, with a 5.02% gain over the past week and a 13.42% s"
    },
    {
        "date": "2024-08-15",
        "title": "Is First Trust Large Cap Core AlphaDEX ETF a Strong ETF Right Now? - First Trust Large Cap Core AlphaDEX Fund (NASDAQ:FEX), iShares Core S&P 500 ETF (ARCA:IVV)",
        "description": "Making its debut on 05/08/2007, smart beta exchange traded fund First Trust Large Cap Core AlphaDEX ETF (NASDAQ: FEX) provides investors broad exposure to the Style Box - Large Cap Blend category of the market."
    },
    {
        "date": "2024-08-15",
        "title": "Is First Trust Multi Cap Growth AlphaDEX ETF a Strong ETF Right Now? - First Trust Multi Cap Growth AlphaDEX Fund (NASDAQ:FAD), iShares Morningstar Large-Cap Growth ETF (ARCA:ILCG)",
        "description": "The First Trust Multi Cap Growth AlphaDEX ETF (NASDAQ: FAD) was launched on 05/08/2007, and is a smart beta exchange traded fund designed to offer broad exposure to the Style Box - All Cap Growth category of the market."
    },
    {
        "date": "2024-08-15",
        "title": "US retail sales for July exceed economists’ projections",
        "description": "U.S. retail sales accelerated in July by the highest level in over a year, Bloomberg reports.  The value of retail purchases, unadjusted for inflation, increased 1% in July and was helped by a sharp snapback in car sales, Commerce Department data showed Thursday. Excluding autos and gasoline stations, sales were up 0.4%. Ten of the […]"
    },
    {
        "date": "2024-08-15",
        "title": "What’s Behind Warren Buffett’s Apple Sales — 'He Doesn’t Usually Do This'",
        "description": "Stocks Analysis by Christopher Hopf covering: Microsoft Corporation, Apple Inc, Amazon.com Inc, NVIDIA Corporation. Read Christopher Hopf's latest article on Investing.com"
    },
    {
        "date": "2024-08-15",
        "title": "Small Caps, Nasdaq Lead Fierce Stock Market Gains On Solid Retail Sales; Meta, Microsoft Issue Buy Signals (Live Coverage)",
        "description": "The stock market today responded bullishly to a favorable report on monthly U.S. retail sales. Retailers advanced. Meta cleared a trendline."
    },
    {
        "date": "2024-08-15",
        "title": "Cisco Posts Upbeat Earnings, Joins Tesla, Ulta Beauty, Robinhood, Dell And Other Big Stocks Moving Higher On Thursday - Cisco Systems (NASDAQ:CSCO)",
        "description": ""
    },
    {
        "date": "2024-08-15",
        "title": "A Consumerized Diagnostic: Looking Back And Ahead On A Decade Of Cologuard",
        "description": "On its 10th anniversary, Cologuard offers a clear model for other companies looking to bring diagnostics to market: focus on enabling a seamless, consumerized experience."
    },
    {
        "date": "2024-08-15",
        "title": "ONGOING DEADLINE ALERT: Faruqi & Faruqi, LLP Investigates Claims on Behalf of Investors of CrowdStrike",
        "description": "Faruqi & Faruqi, LLP Securities Litigation Partner James (Josh) Wilson Encourages Investors Who Suffered Losses Exceeding $100,000 In CrowdStrike To..."
    },
    {
        "date": "2024-08-15",
        "title": "J&J Eyes Texas as Venue for Next Round of Baby Powder Fight",
        "description": "Johnson & Johnson was twice blocked in New Jersey from getting bankruptcy protection from one of its units to resolve billions of dollars in cancer"
    },
    {
        "date": "2024-08-15",
        "title": "Apple's iPhone 15 September quarter builds to see record high: Morgan Stanley",
        "description": "Morgan Stanley noted that Apple's (AAPL) iPhone 15 builds were stronger than expected in July and that momentum seems to be building into the iPhone 16 launch."
    },
    {
        "date": "2024-08-15",
        "title": "ONGOING DEADLINE ALERT: Faruqi & Faruqi, LLP Investigates Claims on Behalf of Investors of Vicor",
        "description": "Faruqi & Faruqi, LLP Securities Litigation Partner James (Josh) Wilson Encourages Investors Who Suffered Losses Exceeding $100,000 In Vicor To Contact..."
    },
    {
        "date": "2024-08-15",
        "title": "Wall Street marches ahead as retail sales quell slowdown worries",
        "description": "Wall Street's main indexes rose about 1% on Thursday as retail sales data for July indicated resilient consumer spending, allaying fears of an imminent recession in the world's biggest economy."
    },
    {
        "date": "2024-08-15",
        "title": "Spotlight on NVIDIA: Analyzing the Surge in Options Activity - NVIDIA (NASDAQ:NVDA)",
        "description": ""
    },
    {
        "date": "2024-08-15",
        "title": "Andreas Halvorsen's Viking Global poured money into tech last quarter",
        "description": "See where the Tiger Management alum put money to work in the sector."
    },
    {
        "date": "2024-08-15",
        "title": "Nvidia Stock: Not The Time To Buy The Dip (NASDAQ:NVDA)",
        "description": "Nvidia Corporation has a great track record of exceeding analysts' forecasts, but these expectations only get higher. Click for my NVDA earnings preview."
    },
    {
        "date": "2024-08-15",
        "title": "Invesco Rising Dividends Fund Q2 2024 Review",
        "description": "Invesco Rising Dividends Fund underperformed its benchmark in Q2 2024. Click here to read the full fund letter."
    },
    {
        "date": "2024-08-15",
        "title": "Amazon: Why I Am Not Worried About The Stock (NASDAQ:AMZN)",
        "description": "Amazon's strong 2Q24 results exceed expectations with AWS growth and retail performance mixed, signaling a shift in customer spending behavior. Learn more on AMZN stock here."
    },
    {
        "date": "2024-08-15",
        "title": "Apple 3rd-party access to NFC unlikely to be game-changer for PayPal: Analysts By Investing.com",
        "description": "Apple 3rd-party access to NFC unlikely to be game-changer for PayPal: Analysts"
    }
]