[
    {
        "date": "2024-07-30",
        "title": "Microsoft: Down 6% On Q4 2024 Earnings After Azure Miss, Did AI Bubble Pop? (NASDAQ:MSFT)",
        "description": "Microsoft reported a double beat for Q4 FY 24, but stock tumbled over 6% in after-hours trading. See why I am upgrading MSFT to a Hold rating."
    },
    {
        "date": "2024-07-30",
        "title": "Earnings call: AudioCodes reports steady growth and dividend in Q2 2024 By Investing.com",
        "description": "Earnings call: AudioCodes reports steady growth and dividend in Q2 2024"
    },
    {
        "date": "2024-07-30",
        "title": "US stock futures mixed before Fed; Microsoft drops on disappointing earnings By Investing.com",
        "description": "US stock futures mixed before Fed; Microsoft drops on disappointing earnings"
    },
    {
        "date": "2024-07-30",
        "title": "GOOGLE WON’T LOSE TO AI. Why?",
        "description": "There’s been a lot of noise recently about OpenAI’s new product on its lineup, SearchGPT, which according to the company, is an AI-powered search engine. But, what does that mean for Google and other…"
    },
    {
        "date": "2024-07-30",
        "title": "US rejects airlines bid for more time on passenger obligations By Reuters",
        "description": "US rejects airlines bid for more time on passenger obligations"
    },
    {
        "date": "2024-07-30",
        "title": "Earnings call: Incyte reports total revenues of $1.4 billion By Investing.com",
        "description": "Earnings call: Incyte reports total revenues of $1.4 billion"
    },
    {
        "date": "2024-07-30",
        "title": "S&P 500, Nasdaq 100 Slide Ahead Of Microsoft Earnings",
        "description": "The S&P 500 and Nasdaq 100 continue their slide following underwhelming earnings reports and poor risk sentiment."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft slides amid weak Azure growth (NASDAQ:MSFT)",
        "description": "Microsoft shares fell in extended hours trading on Tuesday after it reported fiscal fourth-quarter results that topped expectations, but Azure growth was weaker-than-expected. Read for more."
    },
    {
        "date": "2024-07-30",
        "title": "ASX Market Open: Index tipped to rise ahead of CPI data, Rio Tinto earnings up 1%",
        "description": "The ASX200 is expected to pick up around a half a per cent this morning."
    },
    {
        "date": "2024-07-30",
        "title": "Global stock index dips on earnings and Fed jitters",
        "description": "NEW YORK (July 31): MSCI's global equities gauge lost ground on Tuesday as investors were jittery ahead of major corporate earnings reports and central bank meetings, while concern about the global economy pushed oil prices lower.\n\nU.S. Treasury yields drifted lower in choppy trading as ..."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft's Strong Q4 Earnings: What It Means For Your Investment Strategy (NASDAQ:MSFT)",
        "description": "Despite Microsoft's slightly elevated valuation, its stock provides investors with an excellent risk-reward profile. Learn more about MSFT stock here."
    },
    {
        "date": "2024-07-30",
        "title": "S&P 500, Nasdaq stumble on caution ahead of tech earnings",
        "description": "NEW YORK (July 31): The S&P 500 and Nasdaq closed lower on Tuesday, weighed down by weak chip and megacap shares ahead of earnings from heavyweight tech companies this week, but the Dow managed modest gains.\n\nMicrosoft, seen by many as leading the artificial intelligence race,fell 0...."
    },
    {
        "date": "2024-07-30",
        "title": "Nvidia Sank Again Today -- Time to Buy the Artificial Intelligence (AI) Growth Stock Hand Over Fist?",
        "description": "Now down 24% from its high, is it time to pounce on Nvidia stock?"
    },
    {
        "date": "2024-07-30",
        "title": "Market Today: Microsoft and Pinterest Shares Plunge Amid Disappointing Guidance",
        "description": "Market Performance\nThe stock market had a mixed showing today ahead of influential earnings news after the close.\n  Dow Jones Industrial Average: +0.5%  Russell"
    },
    {
        "date": "2024-07-30",
        "title": "Tesla Q2: Automotive Gross Margin Is The Key (NASDAQ:TSLA)",
        "description": "Tesla, Inc. stock price plunged about 12% after the Q2 earnings report. What does this mean for TSLA stock price? Click here for my analysis."
    },
    {
        "date": "2024-07-30",
        "title": "AMD Regains Its Footing With Solid Q2 Report (NASDAQ:AMD)",
        "description": "Advanced Micro Devices, Inc. beat Q2 expectations with strong revenue growth projected for Q3. Click for my updated look at AMD stock post the Q2 earnings release."
    },
    {
        "date": "2024-07-30",
        "title": "Stocks Drop As Earnings, The BOJ and FED Come Into Focus",
        "description": "It was a rough day for tech stocks again as the USDJPY fell."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft sinks, chipmakers climb as AI rally faces divide By Reuters",
        "description": "Microsoft sinks, chipmakers climb as AI rally faces divide"
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft sinks, chipmakers climb as AI rally faces divide",
        "description": "Disappointing quarterly results from Microsoft melted $340 billion of stock market value on Tuesday from it and rival heavyweights racing to dominate artificial intelligence technology, while Nvidia and other AI chip sellers rallied after results from Advanced Micro Devices.  In its report after the bell, Microsoft said revenue from its Intelligent Cloud unit - home to the Azure cloud-computing platform - jumped 19% to $28.5 billion in the quarter ended June 30, but missed analysts' estimates of $28.7 billion, LSEG data showed.  Its capital expenditure, including finance leases, jumped 78% in the quarter to $19 billion, with Microsoft saying it needs to expand its global network of data centers and overcome capacity constraints to meet AI demand."
    },
    {
        "date": "2024-07-30",
        "title": "Live updates: Rex Airlines enters administration, June quarterly inflation data to be released, ASX likley to rise",
        "description": "Rex Airlines' decision to enter into voluntary administration is expected to result in up to 850 workers losing their jobs, while the Australian share market is likely to open slightly higher ahead of the latest ABS inflation data. Follow live."
    },
    {
        "date": "2024-07-30",
        "title": "Earnings call: Element Solutions reported a 20% year-over-year growth By Investing.com",
        "description": "Earnings call: Element Solutions reported a 20% year-over-year growth"
    },
    {
        "date": "2024-07-30",
        "title": "Earnings call: Vivo reports robust Q2 2024 earnings with expanded customer base By Investing.com",
        "description": "Earnings call: Vivo reports robust Q2 2024 earnings with expanded customer base"
    },
    {
        "date": "2024-07-30",
        "title": "Morning Bid: The biggest day for markets this year By Reuters",
        "description": "Morning Bid: The biggest day for markets this year"
    },
    {
        "date": "2024-07-30",
        "title": "Arista Stock: Earnings, Revenue Top Estimates Amid Tech Sell-Off",
        "description": "Arista stock clawed back after the maker of computer networking gear reported Q2 earnings and revenue that topped estimates."
    },
    {
        "date": "2024-07-30",
        "title": "Dow Jones Futures Fall On Microsoft, But AMD Jumps After Nvidia Sell-Off; Fed Pivot Looms",
        "description": "Dow Jones futures: Microsoft earnings topped, but Azure cloud-computing growth missed. MSFT tumbled, but AMD rallied late after Nvidia dived."
    },
    {
        "date": "2024-07-30",
        "title": "Earnings To Watch: Meta Platforms Inc(META) Reports Q2 2024 Results",
        "description": "Meta Platforms Inc(META) is set to release its Q2 2024 earnings on July 31, 2024. The consensus estimate for Q2 2024 revenue is $38,286.20 million, and the earn"
    },
    {
        "date": "2024-07-30",
        "title": "Market Recap for 7/30/24",
        "description": "Dow +203.40 at 40743.13, Nasdaq -222.78 at 17147.42, S&P -27.10 at 5436.44 Nasdaq Composite:+14.2% YTD S&P 500: +14.0% YTD Russell 2000: +10.7% YTD S&P Midcap 400: +10.7% YTD Dow Jones Industrial Average: +8.1% YTD The stock market has a mixed showing today in front of influential earnings news after the close. The Dow Jones Industrial Average (+0.5%) and…"
    },
    {
        "date": "2024-07-30",
        "title": "Dow Jones Futures Fall On Microsoft, But AMD Jumps After Nvidia Sell-Off; Fed Pivot Looms",
        "description": "Dow Jones futures: Microsoft earnings topped, but Azure cloud-computing growth missed. MSFT tumbled, but AMD rallied late after Nvidia dived."
    },
    {
        "date": "2024-07-30",
        "title": "S&P 500 Gains and Losses Today: Merck Stock Plunges on Guidance Cut",
        "description": "The S&P 500 fell 0.5% on Tuesday, July 30, 2024, as tech stocks lost ground ahead of key earnings reports and a decision on interest rates from the Federal Reserve."
    },
    {
        "date": "2024-07-30",
        "title": "Nasdaq falls again while Dow advances",
        "description": "Dow Jones Industrial Average gains 0.5 per cent to 40,743.33. Read more at straitstimes.com."
    },
    {
        "date": "2024-07-30",
        "title": "Keeley Funds' Mid Cap Dividend Value Fund 2nd-Quarter Commentary: A Reflection",
        "description": "To Our Shareholders, For the quarter ended June 30, 2024, the Keeley Mid Cap Dividend Value Fund's net asset value (”\u009cNAV”\u009d) per Class A share fell 4.3% compa"
    },
    {
        "date": "2024-07-30",
        "title": "3 Buyable Berkshire DiviDogs From July And 6 More To Watch",
        "description": "$5k invested in the lowest-priced 5 top-yield Berkshire-held July dividend stocks showed 2.61% more net-gain than invested in all 10. Explore more details here."
    },
    {
        "date": "2024-07-30",
        "title": "AMD Surges After Demand for AI Chips Bolsters Sales Forecast",
        "description": "(Bloomberg) -- Advanced Micro Devices Inc. shares rallied after the chipmaker gave an upbeat revenue forecast, underscoring that its new artificial intelligence processors are bolstering growth.Most Read from BloombergLuxury Heir Alleges His $13 Billion Hermès Fortune Has VanishedKamala Harris Wipes Out Trump’s Swing-State Lead in Election Dead HeatRich Hong Kong Families Sell Mansions at Discounts to Repay DebtVenezuela’s Opposition Says It Has Proof of Election FraudTech Stocks Hit as Microsof"
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft cloud growth misses estimates in Q4 despite jump in investment spending By Investing.com",
        "description": "Microsoft cloud growth misses estimates in Q4 despite jump in investment spending"
    },
    {
        "date": "2024-07-30",
        "title": "Stock Market Today: S&P500 closes lower as Fed kicks off meeting By Investing.com",
        "description": "Stock Market Today: S&P500 closes lower as Fed kicks off meeting"
    },
    {
        "date": "2024-07-30",
        "title": "Pinterest Stock Sinks As Light Sales Outlook Overshadows Earnings Beat",
        "description": "Pinterest stock sank late Tuesday as Q2 sales and earnings beat expectations but the company gave a lower-than-expected sales outlook."
    },
    {
        "date": "2024-07-30",
        "title": "DEADLINE ALERT: Faruqi & Faruqi, LLP Investigates Claims on Behalf of Investors of Vicor",
        "description": "Faruqi & Faruqi, LLP Securities Litigation Partner James (Josh) Wilson Encourages Investors Who Suffered Losses Exceeding $100,000 In Vicor To Contact..."
    },
    {
        "date": "2024-07-30",
        "title": "SCHD: Built For Winners (NYSEARCA:SCHD)",
        "description": "Schwab U.S. Dividend Equity is a low-cost ETF with ~100 positions diversified across market sectors. Find out why I rate SCHD a hold."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft plunges as Big Tech sell-off deepens",
        "description": "Microsoft shares have fallen heavily as the software giant reported disappointing results that deepened investors’ fears about the artificial intelligence boom."
    },
    {
        "date": "2024-07-30",
        "title": "Market Volatility: Dollar Steady, Gold Rises, Bitcoin Nears $66k",
        "description": "[Chart courtesy of MarketWatch.com] The stock market opened on a positive note but soon fluctuated around their respective unchanged lines, as traders focused on earnings reports and the Federal Reserve’s policy meeting. By the end of the session, only the Dow managed to close in positive territory, while the S&P 500 and Nasdaq ended in the red. Interestingly, despite the ... Read More"
    },
    {
        "date": "2024-07-30",
        "title": "Arista Networks Stock Gains on Better-Than-Expected Q2 Results By Investing.com",
        "description": "Arista Networks Stock Gains on Better-Than-Expected Q2 Results"
    },
    {
        "date": "2024-07-30",
        "title": "Why Lumen Technologies Stock Jumped 77.3% Today",
        "description": "The boom in AI data centers could pay off for Lumen Technologies."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft cloud growth misses estimates in Q4 despite jump in investment spending By Investing.com",
        "description": "Microsoft cloud growth misses estimates in Q4 despite jump in investment spending"
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft's downbeat Azure growth sparks tech sell-off as AI payoff takes longer By Reuters",
        "description": "Microsoft's downbeat Azure growth sparks tech sell-off as AI payoff takes longer"
    },
    {
        "date": "2024-07-30",
        "title": "AMD forecasts third-quarter revenue above estimates on AI chip demand By Reuters",
        "description": "AMD forecasts third-quarter revenue above estimates on AI chip demand"
    },
    {
        "date": "2024-07-30",
        "title": "10 Micro Cap Stocks That Will Skyrocket",
        "description": "One of the more well known quotes of Warren Buffett is"
    },
    {
        "date": "2024-07-30",
        "title": "Keeley Funds' Small-Mid Cap Value Fund 2nd-Quarter Commentary: A Snapshot",
        "description": "To Our Shareholders, For the quarter ended June 30, 2024, the Keeley Small-Mid Cap Value Fund's net asset value (”\u009cNAV”\u009d) per Class A share declined 4.1%, bet"
    },
    {
        "date": "2024-07-30",
        "title": "EOS: Strong Performance And Attractive Monthly Distribution (NYSE:EOS)",
        "description": "Eaton Vance Enhanced Equity Income Fund II offers a tech-heavy portfolio while employing a covered call strategy. Explore more details here."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft tells employees it will hand out one-time cash awards of up to 25% of annual bonus",
        "description": "Microsoft wants to reward rank-and-file employees for helping to deliver accelerating revenue growth for the fiscal year that just ended."
    },
    {
        "date": "2024-07-30",
        "title": "Mad 7: Microsoft Tanks, Down $250 Billion After Cloud Miss",
        "description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero"
    },
    {
        "date": "2024-07-30",
        "title": "Nasdaq Moves Sharply Lower As Tech Stocks Slump But Dow Moves Higher",
        "description": "After ending yesterday's choppy trading session narrowly mixed, the major U.S. stock indexes moved in more starkly opposite directions during trading on Tuesday."
    },
    {
        "date": "2024-07-30",
        "title": "Broader stocks move lower ahead of a number of key earnings announcements",
        "description": "Big cap tech moves lower ahead of Microsoft earnings. S&P also lower."
    },
    {
        "date": "2024-07-30",
        "title": "Stock Market News Today: Markets slide ahead of Fed with earnings deluge on tap (SP500)",
        "description": "Technology stocks on Tuesday suffered another selloff, sending the broader U.S. market largely lower. Read more here."
    },
    {
        "date": "2024-07-30",
        "title": "Stock Market Today: Dow ends up 200 points, Nasdaq falls 1.3% as Microsoft results, Fed decision loom",
        "description": "Follow all the action in markets on Tuesday."
    },
    {
        "date": "2024-07-30",
        "title": "Microsoft GAAP EPS of $2.95 beats by $0.02, revenue of $64.7B beats by $260M (NASDAQ:MSFT)",
        "description": "Microsoft beats Q4 earnings expectations with a GAAP EPS of $2.95 and revenue of $64.7B, driven by growth in Productivity, Intelligent Cloud, and More..."
    },
    {
        "date": "2024-07-30",
        "title": "Can Rotation Into Small-Caps Work Absolutely Or Just Relatively?",
        "description": "Market signals indicated a possible top, leading to selling of domestic equity ETF exposure despite rotation into Mid & Small Caps. Read more here."
    },
    {
        "date": "2024-07-30",
        "title": "Net buying activity in tech on IBKR's weekly most-active list 'remarkable' despite selloff",
        "description": "Interactive Brokers' (IBKR) weekly list of the most-active symbols on its trading platform showed"
    },
    {
        "date": "2024-07-30",
        "title": "Keeley Funds' Small Cap Dividend Value Fund 2nd-Quarter Commentary: A Recap",
        "description": "To Our Shareholders, For the quarter ended June 30, 2024, the Keeley Small Cap Dividend Value Fund's net asset value (”\u009cNAV”\u009d) per Class A share fell 0.4% com"
    },
    {
        "date": "2024-07-30",
        "title": "Wells Fargo appoints new head of technology By Reuters",
        "description": "Wells Fargo appoints new head of technology"
    },
    {
        "date": "2024-07-30",
        "title": "Tesla recalls 1.85 million vehicles over unlatched hood detection problem",
        "description": "Elon Musk's Tesla announced the recall of 1.85 million vehicles to address an issue in which a vehicle's software fails to detect an unlatched hood that could unexpectedly open."
    },
    {
        "date": "2024-07-30",
        "title": "Why Nvidia Stock Continued to Slide Today",
        "description": "Nvidia shares could be volatile in a busy earnings week."
    },
    {
        "date": "2024-07-30",
        "title": "OpenAI releases realistic voice assistant to select subscribers: report",
        "description": "Microsoft-backed OpenAI has released it realistic voice assistant for ChatGPT to a limited number of Plus subscribers today, according to reports. Read more here."
    },
    {
        "date": "2024-07-30",
        "title": "A Bullish Recession: 5 Reasons to Buy Stocks Despite the Anticipated Market Drop",
        "description": "Stocks Analysis by Chris Porteous covering: S&P 500, NVIDIA Corporation, Marriott International Inc, Advanced Micro Devices Inc. Read Chris Porteous's latest article on Investing.com"
    },
    {
        "date": "2024-07-30",
        "title": "Nvidia and Other Chip Stocks Drag S&P 500, Nasdaq Lower Tuesday—Here’s Why",
        "description": "Nvidia and other chip stocks lost ground Tuesday, dragging the S&P 500 and Nasdaq down with them—here's why."
    },
    {
        "date": "2024-07-30",
        "title": "Nvidia and Other Chip Stocks Drag S&P 500, Nasdaq Lower Tuesday—Here’s Why",
        "description": "Nvidia and other chip stocks lost ground Tuesday, dragging the S&P 500 and Nasdaq down with them—here's why."
    },
    {
        "date": "2024-07-30",
        "title": "Top Research Reports for Microsoft, Meta & JPMorgan Chase",
        "description": "Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corporation (MSFT), Meta Platforms, Inc. (META) and JPMorgan Chase & Co. (JPM), as well a micro-cap stock Applied Energetics, Inc. (AERG)."
    },
    {
        "date": "2024-07-30",
        "title": "Cybersecurity Firm Tenable Is Exploring a Potential Sale",
        "description": "Tenable Holdings Inc. is exploring options including a potential sale after receiving takeover interest, according to people familiar with the matter, as dealmaking in the cybersecurity sector heats up."
    },
    {
        "date": "2024-07-30",
        "title": "Amazon Q2: How Historical Profitability Can Help Understand Future Price Movements (AMZN)",
        "description": "Amazon.com, Inc. stock has shown volatility post-Q1. Read why a Buy recommendation for AMZN is still confident ahead of Q2 earnings on August 1."
    },
    {
        "date": "2024-07-30",
        "title": "Have the major U.S. stocks peaked for the year?",
        "description": "The S&amp;P 500 Index has probably already logged the gains it will see this year, but still presents opportunities for investors. Read more."
    },
    {
        "date": "2024-07-30",
        "title": "Howmet Aerospace Inc. (HWM) Q2 2024 Earnings Call Transcript",
        "description": "Howmet Aerospace Inc. (NYSE:NYSE:HWM) Q2 2024 Earnings Conference Call July 30, 2024 10:00 AM ETCompany ParticipantsPaul Luther - Vice President of Investor..."
    },
    {
        "date": "2024-07-30",
        "title": "Instagram to allow users create their own chatbots through AI studio",
        "description": "The broader universe of Instagram users will be able to make a themed chatbot for their profile, for example a bot focused on mixed martial arts, dining or pets"
    },
    {
        "date": "2024-07-30",
        "title": "A Trillion-Dollar Question: What's ROR On Gen AI Capex? (SP500)",
        "description": "The investment community is starting to question the profitability of Gen AI capex spending. Read why I believe the Gen AI bubble is likely to burst."
    },
    {
        "date": "2024-07-30",
        "title": "Tech Stocks Drop Ahead Of Key Earnings; Nvidia Falls, CrowdStrike Hits 8-Month Low: What's Driving Markets Tuesday?",
        "description": "Investor sentiment took a hit on Tuesday as caution prevailed ahead of significant market events, including key tech earnings reports and the Federal Open Market Committee meeting. The Nasdaq 100, heavily weighted with tech stocks, experienced the most significant decline among major U.S. indices, dropping 1.5%. Semiconductor stocks were particularly affected, with Nvidia Corp. (NASDAQ:NVDA) plummeting over 6% to a two-month low, impacting the entire industry. Consequently, the iShares Semicondu"
    },
    {
        "date": "2024-07-30",
        "title": "Nvidia shares sink up to 8% as tech sell-off reignites",
        "description": "Chipmaker has lost about $750bn in market value over past six weeks"
    },
    {
        "date": "2024-07-30",
        "title": "Tech Bull Market Just Starting - Dan Ives",
        "description": "Wedbush Securities' Dan Ives shares why he sees the tech bull market going for 2-3 years. Qualcomm, Nvidia, Apple, and how generative AI is reshaping tech."
    },
    {
        "date": "2024-07-31",
        "title": "Shareholder Alert: Robbins LLP Informs Investors of the Class Action Filed Against CrowdStrike Holdings, Inc. (CRWD)",
        "description": "Robbins LLP is Investigating Allegations that CrowdStrike Holdings, Inc. (CRWD) Misled Investors Regarding the Efficacy of its Falcon Product..."
    },
    {
        "date": "2024-07-31",
        "title": "Elon Musk’s xAI considers buying Character.ai- The Information By Investing.com",
        "description": "Elon Musk’s xAI considers buying Character.ai- The Information"
    },
    {
        "date": "2024-07-31",
        "title": "Meta Platforms, Inc. (META) Q2 2024 Earnings Call Transcript",
        "description": "Meta Platforms, Inc. (NASDAQ:NASDAQ:META) Q2 2024 Earnings Conference Call July 31, 2024 5:00 PM ETCompany ParticipantsKenneth Dorell - Director of IRMark..."
    },
    {
        "date": "2024-07-31",
        "title": "Yen soars to strongest since March after Japan raises interest rates",
        "description": "The yen jumped 1.5 per cent to 112.1367 against the Singapore dollar on July 31 after the BOJ move. Read more at straitstimes.com."
    },
    {
        "date": "2024-07-31",
        "title": "S&P advances more than 1% in July amid Fed rate cut bets, 'rotation' buzz (NYSEARCA:SPY)",
        "description": "The S&P 500 (SP500) on Wednesday climbed 1.13% for July to close at 5,522.30 points, its smallest monthly advance since May 2023. Read more here."
    },
    {
        "date": "2024-07-31",
        "title": "Republicans call Harris a failed border czar. The facts tell a different story By Reuters",
        "description": "Republicans call Harris a failed border czar. The facts tell a different story"
    },
    {
        "date": "2024-07-31",
        "title": "Mark Zuckerberg says Meta’s AI tool is on pace to be the ‘most used’ in the world",
        "description": "Meta reported stronger-than-expected results for the second quarter on Wednesday, sending shares sharply higher in after-hours trading."
    },
    {
        "date": "2024-07-31",
        "title": "Arm outlook disappoints Wall Street, shares dive 13% By Reuters",
        "description": "Arm outlook disappoints Wall Street, shares dive 13%"
    },
    {
        "date": "2024-07-31",
        "title": "S&P 500, Nasdaq boosted by chip rally, Fed rate cut signals",
        "description": "NEW YORK (Aug 1): The S&P 500 and Nasdaq scored their biggest daily percentage gains since Feb. 22 and the Dow rose on Wednesday as chip stocks rallied and the Federal Reserve kept U.S. interest rates unchanged while signaling possible easing in September if inflation cools.\n\nSeven o..."
    },
    {
        "date": "2024-07-31",
        "title": "Russell rise: Top 5 best, worst performers during July's rally in small-cap stocks",
        "description": "Here's are the top 5 biggest gainers and decliners in the iShares Russell 2000 ETF during July's jump in small-cap stocks. Read more here."
    },
    {
        "date": "2024-07-31",
        "title": "Market Today: Meta and Qualcomm Surge, Arm Holdings and Teladoc Disappoint",
        "description": "Market Performance\nThe S&P 500 jumped 1.6% and the Nasdaq Composite logged a 2.6% gain. Meanwhile, the Dow Jones Industrial Average (+0.2%) and Russell 2000 (+0"
    },
    {
        "date": "2024-07-31",
        "title": "Meta Platforms: Loved The Earnings, Hated The After Hours Rally (NASDAQ:META)",
        "description": "Meta Platforms, Inc.'s Q2 earnings report exceeded expectations with lower CAPEX and higher FCF. Click here to read an analysis of META stock now."
    },
    {
        "date": "2024-07-31",
        "title": "Here's What Investing $1,000 in Billionaire Bill Ackman's Portfolio Could Have Made You This Year",
        "description": "Billionaire Bill Ackman is making headlines after reports that the much-hyped IPO of his investment fund Pershing Square USA is eyeing to raise just about $2 billion, significantly lower than the initial plans of $25 billion. Regardless of how this ..."
    },
    {
        "date": "2024-07-31",
        "title": "Remitly Announces CFO Transition Plan",
        "description": "Remitly Announces CFO Transition Plan.\nVikas Mehta to succeed Hemanth Munipalli as Chief Financial Officer...."
    },
    {
        "date": "2024-07-31",
        "title": "Morning bid: Extraordinary rally rips through all markets By Reuters",
        "description": "Morning bid: Extraordinary rally rips through all markets"
    },
    {
        "date": "2024-07-31",
        "title": "Dow Jones Futures: Stocks Rally On AI, Rate-Cut Optimism; Meta, Carvana Jump Late, Arm Dives",
        "description": "Dow Jones futures: Techs jumped on revived AI optimism and as Jerome Powell said a September Fed rate cut is possible. Meta jumped late."
    },
    {
        "date": "2024-07-31",
        "title": "CRWD INVESTOR ALERT: Robbins Geller Rudman & Dowd LLP Announces that CrowdStrike Holdings, Inc. Investors with Substantial Losses Have Opportunity to Lead the CrowdStrike Class Action Lawsuit",
        "description": "SAN DIEGO, July  31, 2024  (GLOBE NEWSWIRE) -- Robbins Geller Rudman & Dowd LLP announces that purchasers or acquirers of CrowdStrike Holdings, Inc...."
    },
    {
        "date": "2024-07-31",
        "title": "S&P 500 Gains and Losses Today: Vistra Surges on License Extension, Power Prices",
        "description": "The S&P 500 jumped 1.6% on Wednesday, July 31, 2024, as the Fed announced its widely expected interest rate hold and tech stocks surged."
    },
    {
        "date": "2024-07-31",
        "title": "Nasdaq leads US stocks higher after Fed decision",
        "description": "Dow Jones Industrial Average climbs 0.2 per cent to 40,842.79. Read more at straitstimes.com."
    },
    {
        "date": "2024-07-31",
        "title": "Meta Platforms Inc (META) Q2 2024 Earnings: EPS of $5.16 Beats Estimates, Revenue Surpasses Expectations at $39.07 Billion",
        "description": "Revenue: $39.07 billion, up by 22% year-over-year, surpassing estimates of $38.31 billion.Net Income: $13.47 billion, a significant increase of 73% compared to"
    },
    {
        "date": "2024-07-31",
        "title": "Meta earnings call: Better spending on AI now, rather than too late (NASDAQ:META)",
        "description": "Meta Platforms stock (META) had risen by more than 4% after hours as it started a conference call to discuss its second-quarter earnings, where the company beat"
    },
    {
        "date": "2024-07-31",
        "title": "Indian Banks Want Customers, But No Smartphones Please",
        "description": "A new liquidity requirement will make less tech-savvy savers more attractive to lenders."
    },
    {
        "date": "2024-07-31",
        "title": "Tumbling lithium prices push Albemarle to fresh round of cost cuts By Reuters",
        "description": "Tumbling lithium prices push Albemarle to fresh round of cost cuts"
    },
    {
        "date": "2024-07-31",
        "title": "Is Microsoft Stock a Buy After Earnings Beat?",
        "description": "Stocks Analysis by ValueWalk (Dave Kovaleski) covering: Microsoft Corporation. Read ValueWalk (Dave Kovaleski)'s latest article on Investing.com"
    },
    {
        "date": "2024-07-31",
        "title": "NVIDIA Sets Conference Call for Second-Quarter Financial Results",
        "description": "CFO Commentary to Be Provided in Writing Ahead of Call..."
    },
    {
        "date": "2024-07-31",
        "title": "Tech Titans Lead Nasdaq Rally Amid Earnings Surprises",
        "description": "[Chart courtesy of MarketWatch.com] The tech sector saw a significant boost, led by Advanced Micro Devices (AMD), which lifted the Nasdaq to an impressive gain after surpassing second-quarter expectations. Nvidia followed suit, achieving its largest single-day gain ever at 12%. Meanwhile, Microsoft experienced a decline due to underwhelming cloud business performance but managed to recover by the close of trading. ... Read More"
    },
    {
        "date": "2024-07-31",
        "title": "Forexlive Americas FX news wrap: What a day, it had everything",
        "description": "Forex news for North American trading on Jul 31, 2024"
    },
    {
        "date": "2024-07-31",
        "title": "Microsoft By The Numbers: Past Performance And Future Valuation (NASDAQ:MSFT)",
        "description": "Microsoft beat earnings estimates but had soft cloud business guidance, resulting in a stock price dip. Find out more on MSFT stock here."
    },
    {
        "date": "2024-07-31",
        "title": "Earnings call: FirstEnergy reports a mix of lower GAAP earnings and higher operating earnings By Investing.com",
        "description": "Earnings call: FirstEnergy reports a mix of lower GAAP earnings and higher operating earnings"
    },
    {
        "date": "2024-07-31",
        "title": "Amazon set to join Big Tech's spending surge as AI race heats up By Reuters",
        "description": "Amazon set to join Big Tech's spending surge as AI race heats up"
    },
    {
        "date": "2024-07-31",
        "title": "US stocks post biggest one-day gain since February to finish the month near flat",
        "description": "Both Nasdaq and S&P 500 gain the most since Feb 22, 2024"
    },
    {
        "date": "2024-07-31",
        "title": "Qualcomm forecasts quarterly revenue above estimates on smartphone strength By Reuters",
        "description": "Qualcomm forecasts quarterly revenue above estimates on smartphone strength"
    },
    {
        "date": "2024-07-31",
        "title": "Qualcomm Gives Bullish Forecast After Phone Demand Perks Up",
        "description": "Qualcomm Inc., the world’s biggest seller of smartphone processors, gave a strong revenue forecast for the current period, indicating that demand for phones is rebounding."
    },
    {
        "date": "2024-07-31",
        "title": "Earnings call: Standard Chartered announced an income increase of 7% By Investing.com",
        "description": "Earnings call: Standard Chartered announced an income increase of 7%"
    },
    {
        "date": "2024-07-31",
        "title": "Facebook parent Meta forecasts upbeat Q3 revenue after strong quarter By Reuters",
        "description": "Facebook parent Meta forecasts upbeat Q3 revenue after strong quarter"
    },
    {
        "date": "2024-07-31",
        "title": "Meta Platforms delivers upbeat guidance as Q2 results beat estimates; shares jump By Investing.com",
        "description": "Meta Platforms delivers upbeat guidance as Q2 results beat estimates; shares jump"
    },
    {
        "date": "2024-07-31",
        "title": "U.S. Stocks Rally On Upbeat Earnings News, Rate Cut Optimism",
        "description": "After moving sharply higher early in the session, stocks continued to turn in a strong performance throughout the trading day on Wednesday. The major averages all moved to the upside after ending Tuesday's trading mixed, with the tech-heavy Nasdaq posting a particularly strong gain."
    },
    {
        "date": "2024-07-31",
        "title": "U.S. Stocks Rally On Upbeat Earnings News, Rate Cut Optimism",
        "description": "After moving sharply higher early in the session, stocks continued to turn in a strong performance throughout the trading day on Wednesday. The major averages all moved to the upside after ending Tuesday's trading mixed, with the tech-heavy Nasdaq posting a particularly strong gain."
    },
    {
        "date": "2024-07-31",
        "title": "Stock market today: Nasdaq surges nearly 3% amid chip rally, dovish Fed comments",
        "description": "US stocks surged on Wednesday, with the Dow popping 300 points as Powell acknowledged the Fed's progress in bringing down inflation."
    },
    {
        "date": "2024-07-31",
        "title": "Stock Market Today: S&P 500 rallies as Fed signals September cut in play By Investing.com",
        "description": "Stock Market Today: S&P 500 rallies as Fed signals September cut in play"
    },
    {
        "date": "2024-07-31",
        "title": "Global Automotive 3D Map System Market Size To Worth USD 13.64 Billion By 2033 | CAGR Of 10.47%",
        "description": "The Global Automotive 3D Map System Market Size was Valued at USD 5.04 Billion in 2023 and the Worldwide Automotive 3D Map System Market Size is Expected..."
    },
    {
        "date": "2024-07-31",
        "title": "Reddit CEO calls out Microsoft, others for scraping site without permission: report",
        "description": "Reddit CEO Steve Huffman called out Microsoft (MSFT), Anthropic and Perplexity for scraping his site's data without permission. Read more here."
    },
    {
        "date": "2024-07-31",
        "title": "Lumen Technologies Stock: Recent Price Spike Begs Questions (NYSE:LUMN)",
        "description": "Lumen Technologies stock saw a significant 5-day move, sparking speculation of small-cap rotation. Check out why I rate LUMN stock as a Buy."
    },
    {
        "date": "2024-07-31",
        "title": "Stocks Race To Best Day In 5 Months As Lower Interest Rate Prospects Jolt Markets",
        "description": "Renewed optimism for battered semiconductor chip stocks sent the market surging Wednesday."
    },
    {
        "date": "2024-07-31",
        "title": "AvidXchange Holdings, Inc. (AVDX) Q2 2024 Earnings Call Transcript",
        "description": "AvidXchange Holdings, Inc. (NASDAQ:NASDAQ:AVDX) Q2 2024 Earnings Conference Call July 31, 2024 10:00 AM ETCompany ParticipantsMichael Praeger - Chairman,..."
    },
    {
        "date": "2024-07-31",
        "title": "July FOMC Meeting Recap: Looser Policy, Soft Landing In Sight",
        "description": "At the conclusion of the Federal Reserve’s two-day July FOMC meeting, the rate-setting committee left its target rate range unchanged. Read more here."
    },
    {
        "date": "2024-07-31",
        "title": "Reliant Holdings, Inc. Appoints Claude Zdanow as New CEO By Investing.com",
        "description": "Reliant Holdings, Inc. Appoints Claude Zdanow as New CEO"
    },
    {
        "date": "2024-07-31",
        "title": "Stocks Soar as Fed Puts Wall Street’s Rate Cut Wish on the Table",
        "description": "(Bloomberg) -- Buy signals flashed across Wall Street Wednesday as traders grew optimistic rate cuts coming soon after Federal Reserve Chair Jerome Powell left the door open to lowering borrowing costs at the central bank’s next meeting in September.Most Read from BloombergKamala Harris Wipes Out Trump’s Swing-State Lead in Election Dead HeatIntel to Cut Thousands of Jobs to Reduce Costs, Fund ReboundLuxury Heir Alleges His $13 Billion Hermès Fortune Has VanishedUkraine Receives First F-16 Fight"
    },
    {
        "date": "2024-07-31",
        "title": "AvePoint Announces General Availability of Cloud Backup Express By Investing.com",
        "description": "AvePoint Announces General Availability of Cloud Backup Express"
    },
    {
        "date": "2024-07-31",
        "title": "Nasdaq Surges Over 3%; Powell Industries Shares Spike Higher - Microsoft (NASDAQ:MSFT)",
        "description": ""
    },
    {
        "date": "2024-07-31",
        "title": "AvePoint Announces General Availability of Cloud Backup Express",
        "description": "Using Microsoft 365 Backup Storage, AvePoint Cloud Backup Express delivers accelerated, secure data protection for all organizations..."
    },
    {
        "date": "2024-07-31",
        "title": "Earnings call: Microsoft's CEO announced annual revenue surpassed $245 billion By Investing.com",
        "description": "Earnings call: Microsoft's CEO announced annual revenue surpassed $245 billion"
    },
    {
        "date": "2024-07-31",
        "title": "Federal Reserve Meeting: Powell Sees Rate Cut 'As Soon As September'; S&P 500 Rallies (Live Coverage) (Live Coverage)",
        "description": "The Federal Reserve is expected to start cutting interest rates in September. Today's meeting may give a clue as to how fast. The S&P 500 is rallying."
    },
    {
        "date": "2024-07-31",
        "title": "It pays to be a lazy investor — but for how long?",
        "description": "Passive investment strategies have outperformed, saving investors a fortune in fees, but it doesn't always pay to be lazy"
    },
    {
        "date": "2024-07-31",
        "title": "Biden Rule On Semiconductor Exports To China Is 'Huge Positive' For Chip Sector, Supply Chain: Dan Ives",
        "description": "New Biden rule boosts US semiconductor industry by expanding powers to stop exports of manufacturing equipment to China, excluding certain countries."
    },
    {
        "date": "2024-07-31",
        "title": "Tesla was in Full Self-Driving mode when it hit and killed Seattle motorcylist, police say By Reuters",
        "description": "Tesla was in Full Self-Driving mode when it hit and killed Seattle motorcylist, police say"
    },
    {
        "date": "2024-07-31",
        "title": "Alphabet and Microsoft defended their AI spending in different ways. Why that matters",
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading."
    },
    {
        "date": "2024-07-31",
        "title": "Nancy Pelosi Loads Up On More Nvidia Shares, Sells Part Of Microsoft Stake Before Q4 Earnings",
        "description": "Nancy Pelosi remains one of the most followed members of Congress when it comes to the disclosure of stock and options trades. The former House speaker disclosed the purchase of more NVIDIA Corporation (NASDAQ:NVDA) shares this week. What Happened: ..."
    },
    {
        "date": "2024-07-31",
        "title": "Mastercard, Inc. (MA) Q2 2024 Earnings Call Transcript",
        "description": "Mastercard, Inc. (NYSE:NYSE:MA) Q2 2024 Earnings Conference Call July 31, 2024 9:00 AM ETCompany ParticipantsDevin Corr - Head of Investor RelationsMichael..."
    },
    {
        "date": "2024-07-31",
        "title": "Why Amazon Stock Popped on Wednesday",
        "description": "Reports suggest the company is expanding its already significant reach."
    },
    {
        "date": "2024-07-31",
        "title": "Blackbaud Q2 Earnings Beat Estimates, Revenues Up Y/Y - Blackbaud (NASDAQ:BLKB), Badger Meter (NYSE:BMI)",
        "description": "Blackbaud (NASDAQ: BLKB) reported second-quarter 2024 non-GAAP earnings per share of $1.08, which surpassed the Zacks Consensus Estimate by 3.9%. The bottom line increased 10.2% year over year."
    },
    {
        "date": "2024-07-31",
        "title": "STAG Industrial, Inc. (STAG) Q2 2024 Earnings Call Transcript",
        "description": "STAG Industrial, Inc. (NYSE:NYSE:STAG) Q2 2024 Earnings Conference Call July 31, 2024 10:00 AM ETCompany ParticipantsSteve Xiarhos - Associate Capital..."
    },
    {
        "date": "2024-07-31",
        "title": "Microsoft Defends Capex Spending Binge As AI Chipmakers Benefit",
        "description": "Microsoft's heavy spending on data centers to support AI is great news for chipmakers and computer vendors. But not for Microsoft stock."
    },
    {
        "date": "2024-07-31",
        "title": "Microsoft To Rally Around 24%? Here Are 10 Top Analyst Forecasts For Wednesday - Microsoft (NASDAQ:MSFT)",
        "description": ""
    },
    {
        "date": "2024-07-31",
        "title": "Why Shares of Powell Industries Are Skyrocketing Today",
        "description": "This industrial stock is ending July with a bang."
    },
    {
        "date": "2024-07-31",
        "title": "Microsoft's Azure posts slowdown in growth, testing investors' patience",
        "description": "The company's Xbox video-gaming unit posted 61 per cent growth in content and services revenue, much of that fueled by the $69 billion purchase of Activision Blizzard, which was completed in October"
    },
    {
        "date": "2024-07-31",
        "title": "Why Broadcom Stock Is Surging Today",
        "description": "That AI stock is climbing thanks to good news on multiple fronts."
    },
    {
        "date": "2024-07-31",
        "title": "Match Group Posts Upbeat Sales, Joins Modine Manufacturing, Scotts Miracle-Gro, NVIDIA And Other Big Stocks Moving Higher On Wednesday",
        "description": ""
    },
    {
        "date": "2024-07-31",
        "title": "JD Vance to Be on “The Dan Bongino Show” Today During 2-3:00 p.m. ET Hour",
        "description": "NEW YORK, July  31, 2024  (GLOBE NEWSWIRE) -- Cumulus Media’s (NASDAQ: CMLS) Westwood One today announced that talk radio host Dan Bongino will host JD..."
    },
    {
        "date": "2024-07-31",
        "title": "Festi hf.: Financial results for Q2 2024",
        "description": "Main results       Sale of goods amounted to ISK 36,037 million, compared to ISK 34,199 million in the previous year, an increase of 5.4% between..."
    },
    {
        "date": "2024-07-31",
        "title": "Visa Options Trading: A Deep Dive into Market Sentiment - Visa (NYSE:V)",
        "description": ""
    },
    {
        "date": "2024-07-31",
        "title": "Nvidia, AMD help power chip surge as sector awaits Qualcomm, ARM results",
        "description": "Semiconductor stocks were sharply higher on Wednesday, boosted in part by gains in Nvidia (NVDA) and AMD (AMD), as the sector awaited quarterly results from Qualcomm and Arm. Read for more."
    },
    {
        "date": "2024-07-31",
        "title": "Style rotation from Growth to Value appears to be the real deal: Yardeni Research By Investing.com",
        "description": "Style rotation from Growth to Value appears to be the real deal: Yardeni Research"
    },
    {
        "date": "2024-07-31",
        "title": "Stock Market News Today: Markets jump ahead of Fed rate decision (SP500)",
        "description": "A powerful rebound in chip stocks on Wednesday set the Nasdaq (COMP:IND) on track for its best single day gain in just over 5 months. Read more here."
    },
    {
        "date": "2024-07-31",
        "title": "Vicor Corporation Class Action: Levi & Korsinsky Reminds Vicor Investors of the Pending Class Action Lawsuit with a Lead Plaintiff Deadline of September 23, 2024 – VICR",
        "description": "NEW YORK, July  31, 2024  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP notifies investors in Vicor Corporation ("
    },
    {
        "date": "2024-08-01",
        "title": "US stock futures sink with payrolls in focus; Apple earnings spark little joy By Investing.com",
        "description": "US stock futures sink with payrolls in focus; Apple earnings spark little joy"
    },
    {
        "date": "2024-08-01",
        "title": "Intel: Turn Off The Lights (NASDAQ:INTC)",
        "description": "Intel Corporation is struggling with AI GPU transition, foundry focus, and weak Q3 guidance. Click here to read my full INTC stock Q2 earnings update."
    },
    {
        "date": "2024-08-01",
        "title": "US targets surging grocery prices in latest probe By Reuters",
        "description": "US targets surging grocery prices in latest probe"
    },
    {
        "date": "2024-08-01",
        "title": "What Apple's Strong Q3 Earnings Mean For Your Investment Approach (NASDAQ:AAPL)",
        "description": "Apple reported strong FY24 Q3 earnings results and announced quarterly diluted earnings per share of $1.40. Learn more on AAPL stock here."
    },
    {
        "date": "2024-08-01",
        "title": "Apple Inc. (AAPL) Q3 2024 Earnings Call Transcript",
        "description": "Apple Inc. (NASDAQ:NASDAQ:AAPL) Q3 2024 Earnings Conference Call August 1, 2024 5:00 PM ETCompany ParticipantsSuhasini Chandramouli - Director of IRTim Cook..."
    },
    {
        "date": "2024-08-01",
        "title": "Amazon says distraction of Olympics, Trump assassination attempt contributed to weak forecast",
        "description": "Amazon CFO Brian Olsavsky told reporters after the company's earnings reports that"
    },
    {
        "date": "2024-08-01",
        "title": "MicroStrategy Incorporated (MSTR) Q2 2024 Earnings Call Transcript",
        "description": "MicroStrategy Incorporated (NASDAQ:NASDAQ:MSTR) Q2 2024 Earnings Conference Call August 1, 2024 5:00 PM ETCompany ParticipantsShirish Jajodia - Vice..."
    },
    {
        "date": "2024-08-01",
        "title": "Amazon spent a staggering $30 billion on its cloud platform this year, with plans to increase",
        "description": "The cloud computing unit, whose customers are mostly businesses, has been attempting to lure in more customers with a service called Amazon Bedrock."
    },
    {
        "date": "2024-08-01",
        "title": "Nvidia faces scrutiny of DOJ antitrust probe: report",
        "description": "Nvidia faces scrutiny by the U.S. Department of Justice over possible antitrust issues related to the acquisition of startup Run:ai, a report said. Read more here."
    },
    {
        "date": "2024-08-01",
        "title": "ROSEN, LEADING INVESTOR COUNSEL, Encourages Vicor Corporation Investors to Secure Counsel Before Important Deadline in Securities Class Action – VICR",
        "description": "NEW YORK, Aug.  01, 2024  (GLOBE NEWSWIRE) --     WHY: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on..."
    },
    {
        "date": "2024-08-01",
        "title": "ASX Market Open: Australian stocks follow US counterparts down on concerning data readings",
        "description": "The Australian stock market is set to open lower on Friday, following a slumping night in the US, influenced by weak economic data."
    },
    {
        "date": "2024-08-01",
        "title": "Nvidia Stock Sank Today -- Is It Time to Buy the Dip?",
        "description": "What's up next for Nvidia stock after an incredible run of volatility?"
    },
    {
        "date": "2024-08-01",
        "title": "US Justice Dept. is investigating Nvidia's acquisition of AI startup, Politico reports By Reuters",
        "description": "US Justice Dept. is investigating Nvidia's acquisition of AI startup, Politico reports"
    },
    {
        "date": "2024-08-01",
        "title": "Intel shares sink with 15% of workforce getting axed, suspends dividend",
        "description": "Intel CEO says he misjudged the boom that has created a windfall for chipmakers such as Nvidia, that are leading the AI race for next generation technology."
    },
    {
        "date": "2024-08-01",
        "title": "Recursion Pharmaceuticals: AI-Driven Techbio With Upcoming Catalysts (NASDAQ:RXRX)",
        "description": "Recursion Pharmaceuticals uses AI in drug development, aiming to increase success rates in lab and animal testing. Read about what's coming next from RXRX stock."
    },
    {
        "date": "2024-08-01",
        "title": "Market Today: Intel Shares Plummet on Weak Guidance and Amazon Beats Earnings Expectations",
        "description": "Market Performance\nThe stock market settled near session lows, resulting in significant declines for the major indices:\n  Dow Jones Industrial Average: -1.2%  S"
    },
    {
        "date": "2024-08-01",
        "title": "Earnings call: Bandwidth Inc. boasts solid Q2 growth with cloud expansion By Investing.com",
        "description": "Earnings call: Bandwidth Inc. boasts solid Q2 growth with cloud expansion"
    },
    {
        "date": "2024-08-01",
        "title": "Amazon slips after profit forecast disappoints on AI costs",
        "description": "Amazon.com Inc. projected profit that missed analysts’ estimates, ramping up its spending to meet demand for artificial intelligence services. The shares dropped in late trading.\n\nOperating income will be $11.5 billion to $15 billion in the period ending in September, the company said Thursday in a statement."
    },
    {
        "date": "2024-08-01",
        "title": "Earnings call: Criteo reports robust growth in Q2 2024, raises guidance By Investing.com",
        "description": "Earnings call: Criteo reports robust growth in Q2 2024, raises guidance"
    },
    {
        "date": "2024-08-01",
        "title": "Earnings call: TC Energy reported a 9% increase in comparable EBITDA By Investing.com",
        "description": "Earnings call: TC Energy reported a 9% increase in comparable EBITDA"
    },
    {
        "date": "2024-08-01",
        "title": "CUSIP Global Services Statement on Proposed Data Standards for the Financial Data Transparency Act",
        "description": "NORWALK, Conn., Aug.  01, 2024  (GLOBE NEWSWIRE) -- In our view, the data standards recently proposed by the FDIC and CFPB, and under consideration by the..."
    },
    {
        "date": "2024-08-01",
        "title": "FirstFT: Tech sell-off hits US stock market",
        "description": "Also in today’s newsletter, Middle East enters ‘new phase’ and the biggest victims of a Tokyo stock rout"
    },
    {
        "date": "2024-08-01",
        "title": "Stocks sink before jobs as tech hit on earnings",
        "description": "Stocks fell sharply and bonds rallied as a fresh dose of weak economic data led traders to reconsider whether Jerome Powell’s Federal Reserve is wise to hold off cutting interest rates before September.\n\nThursday’s price action was another episode of extreme day-to-day volatility that has featured rapid rotations into and out of asset classes and sectors, with investors choosing Treasuries as the latest haven trade."
    },
    {
        "date": "2024-08-01",
        "title": "A Hike, A Hold, A Cut: Central Banks Diverge But for How Long?",
        "description": "Three of the world’s largest central banks moved interest rates in different directions this week as a long-awaited, but potentially short-lived, divergence in mone…"
    },
    {
        "date": "2024-08-01",
        "title": "Apple (AAPL) Q3 Earnings: Taking a Look at Key Metrics Versus Estimates",
        "description": "While the top- and bottom-line numbers for Apple (AAPL) give a sense of how the business performed in the quarter ended June 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."
    },
    {
        "date": "2024-08-01",
        "title": "Apple sales rebound as AI bets scramble markets",
        "description": "Apple sales returned to growth, but Intel reported a sales slump and announced sweeping job cuts."
    },
    {
        "date": "2024-08-01",
        "title": "Morning Bid: Markets wilt as growth fears slam yields By Reuters",
        "description": "Morning Bid: Markets wilt as growth fears slam yields"
    },
    {
        "date": "2024-08-01",
        "title": "Amazon (AMZN) Q2 2024 Earnings: EPS of $1.26 Beats Estimates, Revenue of $148.0 Billion Slightly Below Expectations",
        "description": "Revenue: $148.0 billion, up by 10% year-over-year, slightly below estimates of $148.56 billion.Net Income: $13.5 billion, or $1.26 per diluted share, compared"
    },
    {
        "date": "2024-08-01",
        "title": "Apple Inc (AAPL) Q3 2024 Earnings: EPS of $1.40 Beats Estimates, Revenue Hits $85.8 Billion",
        "description": "Revenue: $85.8 billion, up 5% year-over-year, surpassing estimates of $84.53 billion.GAAP EPS: $1.40, up 11% year-over-year.Net Income: $21.45 billion, compare"
    },
    {
        "date": "2024-08-01",
        "title": "Dow Jones Futures Fall As Apple, Amazon Follow Market Expectations Breaker; Nvidia Tumbles",
        "description": "Dow Jones futures: The stock market suffered an expectations breaker Thursday. Apple and Amazon were earnings movers late."
    },
    {
        "date": "2024-08-01",
        "title": "Tesla's Disappointing Earnings Combine With Unfocused Management (NASDAQ:TSLA)",
        "description": "Tesla's valuation is not justified by its financial performance, market potential, or competition in the self-driving industry. Read more on TSLA stock here."
    },
    {
        "date": "2024-08-01",
        "title": "US stocks tumble after weak manufacturing data",
        "description": "Dow Jones Industrial Average finishes down 1.2 per cent at 40,347.97. Read more at straitstimes.com."
    },
    {
        "date": "2024-08-01",
        "title": "Apple (AAPL) Q3 Earnings and Revenues Surpass Estimates",
        "description": "Apple (AAPL) delivered earnings and revenue surprises of 4.48% and 1.59%, respectively, for the quarter ended June 2024. Do the numbers hold clues to what lies ahead for the stock?"
    },
    {
        "date": "2024-08-01",
        "title": "Apple Revenue Tops Estimates Even as China Sales Remain Slow",
        "description": "Apple Inc. marked a return to revenue growth last quarter, lifted by the long-awaited arrival of new iPads, even as sales remained sluggish in China."
    },
    {
        "date": "2024-08-01",
        "title": "Chip index collapses 7% as Arm punctures AI optimism By Reuters",
        "description": "Chip index collapses 7% as Arm punctures AI optimism"
    },
    {
        "date": "2024-08-01",
        "title": "Nasdaq futures fall nearly 3% after hours as Intel plunges",
        "description": "Nasdaq-100 futures were under pressure late Thursday as Intel shares sank. Read more here."
    },
    {
        "date": "2024-08-01",
        "title": "Qualcomm Q3: AI PC And Handsets Won’t Save The Company (NASDAQ:QCOM)",
        "description": "Qualcomm Incorporated faces risks from Apple's potential use of in-house 5G chips and export restrictions to Huawei in China. Learn more about QCOM stock here."
    },
    {
        "date": "2024-08-01",
        "title": "Exlservice Holdings executive sells over $1m in stock By Investing.com",
        "description": "Exlservice Holdings executive sells over $1m in stock"
    },
    {
        "date": "2024-08-01",
        "title": "S&P 500 Gains and Losses Today: Moderna Drops as Soft Vaccine Demand Prompts Guidance Cut",
        "description": "The S&P 500 fell 1.4% on Thursday, Aug. 1 ahead of the latest tech earnings reports and as several data points raised concerns about the health of the U.S. economy."
    },
    {
        "date": "2024-08-01",
        "title": "Apple Q3 results tops estimates as services growth offsets softer iPhone sales By Investing.com",
        "description": "Apple Q3 results tops estimates as services growth offsets softer iPhone sales"
    },
    {
        "date": "2024-08-01",
        "title": "Apple ticks up as Q3 results top expectations (AAPL)",
        "description": "Apple (AAPL) shares rose slightly in extended trading on Thursday after the iPhone maker reported fiscal third-quarter results that topped expectations. Read for more."
    },
    {
        "date": "2024-08-01",
        "title": "Amazon projects profit that misses estimates, signalling AI costs",
        "description": "Amazon projected profit that missed analysts’ estimates, suggesting the company is spending more than anticipated. Find out more."
    },
    {
        "date": "2024-08-01",
        "title": "Why Goodyear Tire & Rubber Stock Plunged 15.9% Today",
        "description": "Tire sales are down despite an improving auto market."
    },
    {
        "date": "2024-08-01",
        "title": "Amazon stock tumbles on weaker than expected sales outlook",
        "description": "Amazon reported second quarter earnings after the bell on Thursday."
    },
    {
        "date": "2024-08-01",
        "title": "Apple revenue returns to growth as iPhone sales top expectations By Reuters",
        "description": "Apple revenue returns to growth as iPhone sales top expectations"
    },
    {
        "date": "2024-08-01",
        "title": "Snap Falls Short on Revenue Despite Jump in Paying Subscribers",
        "description": "Snap Inc. reported second-quarter sales that fell just short of analyst expectations, a slight step-back in the company’s years-long quest to rebuild its core advertising business."
    },
    {
        "date": "2024-08-01",
        "title": "Apple earnings beat by $0.05, revenue topped estimates By Investing.com",
        "description": "Apple earnings beat by $0.05, revenue topped estimates"
    },
    {
        "date": "2024-08-01",
        "title": "Apple GAAP EPS of $1.40 beats by $0.06, revenue of $85.8B beats by $1.42B (NASDAQ:AAPL)",
        "description": "Apple press release (AAPL): Q3 GAAP EPS of $1.40 beats by $0.06. Revenue of $85.8B (+4.9% Y/Y) beats by $1.42B. Net sales by category: 3Q24 3Q23 9M24 9M23 iPhon"
    },
    {
        "date": "2024-08-01",
        "title": "U.S. Stocks Move Sharply Lower As Data Raises Economic Concerns",
        "description": "After extending yesterday's rally early in the session, stocks moved sharply lower over the coursed the trading day on Thursday. The major averages all showed substantial moves to the downside."
    },
    {
        "date": "2024-08-01",
        "title": "Amazon Q2 Earnings Highlights: Revenue Miss, EPS Beat, Q3 Guidance And More - Amazon.com (NASDAQ:AMZN)",
        "description": "Earnings highlights from Amazon.com Q2 results and a look at what's next."
    },
    {
        "date": "2024-08-01",
        "title": "Amazon reports boost in quarterly profits but misses revenue estimates",
        "description": "Amazon reported a boost in its quarterly profits Thursday, but the company missed revenue estimates, sending stocks lower in after-hours trading.  The Seattle-based tech company said it earned $13.5 billion for the April-June period, higher than the $10.99 billion industry analysts surveyed by FactSet had anticipated.  Overall, the company posted revenue of $148 billion, a 10% increase that fell slightly below analyst expectations of $148.67 billion."
    },
    {
        "date": "2024-08-01",
        "title": "Matthews International Reports Results for Fiscal 2024 Third Quarter",
        "description": "Fiscal 2024 Third Quarter Financial Highlights:        Outstanding debt reduced by $12.6 million during the quarter3rd Quarter GAAP EPS of $0.06; non-GAAP..."
    },
    {
        "date": "2024-08-01",
        "title": "Meta Mints Money, Canva Acquires Leonardo AI, Hedra Gen-AI Video Launches",
        "description": "Meta's second quarter revenue is up 22%, extending its winning streak. Canva's adding Gen-AI to keep up with former suitor Adobe. Hedra generates video and audio."
    },
    {
        "date": "2024-08-01",
        "title": "Intel to cut 15% jobs, suspend dividend in turnaround push By Reuters",
        "description": "Intel to cut 15% jobs, suspend dividend in turnaround push"
    },
    {
        "date": "2024-08-01",
        "title": "Amazon.com earnings beat by $0.23, revenue fell short of estimates By Investing.com",
        "description": "Amazon.com earnings beat by $0.23, revenue fell short of estimates"
    },
    {
        "date": "2024-08-01",
        "title": "Amazon earnings: Stock falls as rare revenue miss offsets AWS beat",
        "description": "Amazon reported second-quarter earnings after the close of trading Thursday. MarketWatch will be breaking down the expectations and results."
    },
    {
        "date": "2024-08-01",
        "title": "Stock Market Today: S&P500 slumps as weaker economic data rattles stocks By Investing.com",
        "description": "Stock Market Today: S&P500 slumps as weaker economic data rattles stocks"
    },
    {
        "date": "2024-08-01",
        "title": "US stocks close sharply lower as bad news is bad news today",
        "description": ""
    },
    {
        "date": "2024-08-01",
        "title": "Stock market news today: Tech stocks crushed, 10-year falls below 4% as weak data shows cracks in US economy",
        "description": "Stocks tumbled Thursday after a run of weak economic data and another sell-off in chip stocks weighed on some of the names leading the hot AI trade."
    },
    {
        "date": "2024-08-01",
        "title": "Nvidia stock falls more than 6%, reversing Wednesday’s rally as chip stocks lead market lower",
        "description": "Chip stocks led a tech-fueled sell-off."
    },
    {
        "date": "2024-08-01",
        "title": "Mark Cuban And Other Venture Capitalists Pledge Support For Kamala Harris, Who's On The List?",
        "description": "Many venture capitalists in Silicon Valley and beyond believe that Vice President Kamala Harris could be a tech-friendly president. Some, such as LinkedIn co-founder Reid Hoffman, have already endorsed the Vice President, but now a new pledge is ..."
    },
    {
        "date": "2024-08-01",
        "title": "Apple Says US Smartphones Suit Has ‘No Relation to Reality’",
        "description": "Apple Inc. said the US government’s antitrust lawsuit accusing the tech giant of monopolizing the smartphone market “bears no relation to reality” and should be tossed out by a federal judge."
    },
    {
        "date": "2024-08-01",
        "title": "Wall Street Analyst Predicts End To Tech Rout: 'Much Of The Selloff May Be In The Rearview Mirror' - Apple (NASDAQ:AAPL), Amazon.com (NASDAQ:AMZN)",
        "description": "Jerome Powell's hint of a rate cut in September led to a tech sell-off on disappointing data and earnings. Some still see buying opportunities."
    },
    {
        "date": "2024-08-01",
        "title": "Exclusive-GM raises bar for employee performance with new ratings system By Reuters",
        "description": "Exclusive-GM raises bar for employee performance with new ratings system"
    },
    {
        "date": "2024-08-01",
        "title": "Meta Earnings: Stock Up, but Plenty of Room to Run",
        "description": "Stocks Analysis by ValueWalk (Dave Kovaleski) covering: Meta Platforms Inc. Read ValueWalk (Dave Kovaleski)'s latest article on Investing.com"
    },
    {
        "date": "2024-08-01",
        "title": "Peru to Raise $3 Billion in First Eurobond Sale Since 2021",
        "description": "Peru is returning to international markets with the first hard-currency bond sale in three years, testing investor appetite for its debt in a two-tranche transaction."
    },
    {
        "date": "2024-08-01",
        "title": "Earnings call: Kyndryl reports robust Q1 results, consult growth By Investing.com",
        "description": "Earnings call: Kyndryl reports robust Q1 results, consult growth"
    },
    {
        "date": "2024-08-01",
        "title": "Here's Why Apple (AAPL) is a Bullish Stock in a Tough August",
        "description": "From launching a new AI platform to providing strategic discounts in China, things look hunky-dory for Apple (APPL) in a moribund August."
    },
    {
        "date": "2024-08-01",
        "title": "Apple files to dismiss DOJ antitrust suit as it's based on 'false premise' (NASDAQ:AAPL)",
        "description": "Apple (AAPL) filed a motion in the U.S. District Court in New Jersey today to dismiss the Department of Justice's antitrust lawsuit, claiming it is based on a f"
    },
    {
        "date": "2024-08-01",
        "title": "Amazon Earnings Are Imminent; These Most Accurate Analysts Revise Forecasts Ahead Of Earnings Call - Amazon.com (NASDAQ:AMZN)",
        "description": ""
    },
    {
        "date": "2024-08-01",
        "title": "Is This the Right Time to Buy NVIDIA Stock?",
        "description": "NVIDIA stock has fallen about 10% since its stock split in June. With this 10% correction, is now the time to buy NVIDIA stock?"
    },
    {
        "date": "2024-08-01",
        "title": "ETF investors purchase the dip - Ned Davis Research (S&P Complete Indices:SP500)",
        "description": "While the major market averages have tumbled during the back half of July, investors were seen purchasing the dip when looking at exchange traded funds, according to Ned Davis Research."
    },
    {
        "date": "2024-08-01",
        "title": "Stocks to Watch in August",
        "description": "July brought big changes to the U.S. stock market, with tech stocks faltering as small-caps roared to life. Now, midway through second-quarter earnings season, we look at a few stocks that could see big moves in August."
    },
    {
        "date": "2024-08-01",
        "title": "SoFi: Strong Earnings Signal A Compelling Investment Opportunity",
        "description": "SoFi produced excellent second quarter 2024 results, with solid revenue growth and GAAP profitability. See why I maintain my buy recommendation for SOFI stock."
    },
    {
        "date": "2024-08-01",
        "title": "Why Nvidia Stock Was Pulling Back Today",
        "description": "More market malaise dragged Nvidia shares lower today."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Corsair Gaming reported a net revenue drop to $261.3 million By Investing.com",
        "description": "Earnings call: Corsair Gaming reported a net revenue drop to $261.3 million"
    },
    {
        "date": "2024-08-02",
        "title": "Tom Gayner's Strategic Moves in Q2 2024 Highlight Franco-Nevada Corp's Prominence",
        "description": "Insight into the Investment Shifts of Markel Corp's Co-CEOTom Gayner (Trades, Portfolio), the Co-Chief Executive Officer of Markel Corporation, has recently dis"
    },
    {
        "date": "2024-08-02",
        "title": "Meta bids millions for celebrity voices in AI race",
        "description": "Users could speak with a chatbot that has the voice of Dame Judi Dench, for example."
    },
    {
        "date": "2024-08-02",
        "title": "Market Today: Nvidia Faces DOJ Probe, Intel Plummets, and Buffett Sells Bank of America Shares",
        "description": "The stock market saw significant declines in the final session of the week, driven by growth concerns. Disappointing economic data indicated a deeper economic s"
    },
    {
        "date": "2024-08-02",
        "title": "Unfailing Recession Signal Ignites Stock Plunge",
        "description": "The weak jobs report triggered the Sahm Rule, which has an unblemished track record in predicting a recession. A September Fed rate cut now seems inevitable."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Butterfly Network reports record Q2 revenue, expands AI By Investing.com",
        "description": "Earnings call: Butterfly Network reports record Q2 revenue, expands AI"
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: MicroStrategy reports Q2 results, emphasizes bitcoin strategy By Investing.com",
        "description": "Earnings call: MicroStrategy reports Q2 results, emphasizes bitcoin strategy"
    },
    {
        "date": "2024-08-02",
        "title": "Technical Analyst: NVIDIA Corp (NASDAQ:NVDA) Has ‘Triggered’ a ‘Sell Signal’",
        "description": "The much-feared correction in mega-cap tech stocks is here as investors keep pulling out of AI winners to pile into small-cap stocks as possible rate cuts from the Federal Reserve near."
    },
    {
        "date": "2024-08-02",
        "title": "Analyst: Microsoft Corp (NASDAQ:MSFT) Is In ‘Phenomenal’ Position for AI Monetization",
        "description": "The much-feared correction in mega-cap tech stocks is here as investors keep pulling out of AI winners to pile into small-cap stocks as possible rate cuts from the Federal Reserve near."
    },
    {
        "date": "2024-08-02",
        "title": "Here’s Why Analysts are Upgrading Amazon.com Inc (NASDAQ:AMZN)",
        "description": "The much-feared correction in mega-cap tech stocks is here as investors keep pulling out of AI winners to pile into small-cap stocks as possible rate cuts from the Federal Reserve near."
    },
    {
        "date": "2024-08-02",
        "title": "Tech stocks wrap up steepest three-week slump in two years, led by plunge in Amazon and Intel",
        "description": "With second-quarter earnings largely in the rearview mirror, Wall Street is troubled by what it's seen out of Silicon Valley."
    },
    {
        "date": "2024-08-02",
        "title": "What’s behind the stock market’s brutal 2-day crash?",
        "description": "The Dow closed down 600 points, the Nasdaq dropped 2.4% and the S&P has fallen 6% from its recent all-time high."
    },
    {
        "date": "2024-08-02",
        "title": "S&P 500 slides 2% for the week as narrative shifts to fears over hard landing, recession",
        "description": "The S&P 500 (SP500) on Friday retreated 2.06% for the week to end at 5,346.56 points, posting losses in three out of five sessions. Read more here."
    },
    {
        "date": "2024-08-02",
        "title": "Apple Loop: New iPhone 16 Leaks, Steve Jobs’ Polaroids, Faster iPhone 16 Pro Revealed",
        "description": "This week’s Apple headlines; Apple’s Q3 earnings call, new iPhone 16 Pro details, Apple Intelligence arrives, iPhone’s speedy upgrade, MacBook Pro monitors, Steve Jobs polaroids, and more..."
    },
    {
        "date": "2024-08-02",
        "title": "Jim Cramer: ‘People are Fleeing’ from Amazon.com Inc (NASDAQ:AMZN)",
        "description": "Cramer said that sometimes it’s difficult to own the “winners.” The CNBC host said it’s important to understand the bear cases around stocks otherwise you will never know what “you are up against..."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Chatham Lodging Trust reports robust Q2 2024 results By Investing.com",
        "description": "Earnings call: Chatham Lodging Trust reports robust Q2 2024 results"
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Twilio announced revenues of $1.1 billion By Investing.com",
        "description": "Earnings call: Twilio announced revenues of $1.1 billion"
    },
    {
        "date": "2024-08-02",
        "title": "JPMorgan considers litigation against consumer watchdog over Zelle (NYSE:JPM)",
        "description": "JPMorgan Chase is considering litigation against a U.S."
    },
    {
        "date": "2024-08-02",
        "title": "Dow ends 2.1% lower for the week after poor jobs data",
        "description": "Dow Jones Industrial Average finishes at 39,737.26, down 1.5 per cent for the day. Read more at straitstimes.com."
    },
    {
        "date": "2024-08-02",
        "title": "1 No-Brainer Artificial Intelligence (AI) Chip Stock With 27% Upside to Buy Hand Over Fist Right Now",
        "description": "Morgan Stanley is calling for significant upside in Arm Holdings stock."
    },
    {
        "date": "2024-08-02",
        "title": "JPMorgan's Jamie Dimon lays out what next US president 'must' do",
        "description": "Jamie Dimon, chairman and CEO of JPMorgan Chase, penned an op-ed laying out a series of measures the next U.S. president should take to restore faith in America."
    },
    {
        "date": "2024-08-02",
        "title": "Lululemon Stock Flops After Nike News. Why It Could Be a Great Time to Buy",
        "description": "Nike's problems might not affect Lululemon as much as the market thinks."
    },
    {
        "date": "2024-08-02",
        "title": "Dow Jones Futures: Apple Leads Resilient Stocks As Recession Fears Grip Market; What To Do Now",
        "description": "Dow Jones futures: The stock market sold off hard on recession fears, though Apple led some resilient names. Here's what to do now."
    },
    {
        "date": "2024-08-02",
        "title": "Plug Power appoints new COO, Dean Fullerton By Investing.com",
        "description": "Plug Power appoints new COO, Dean Fullerton"
    },
    {
        "date": "2024-08-02",
        "title": "First Pacific Advisors Adjusts Portfolio, Major Reduction in Broadcom Inc",
        "description": "Insight into First Pacific Advisors (Trades, Portfolio)' Latest 13F Filing for Q2 2024\n\nFirst Pacific Advisors (Trades, Portfolio), a prominent Los Angeles-base"
    },
    {
        "date": "2024-08-02",
        "title": "Why Stocks Just Had Their Most Volatile Two Weeks in Over a Year",
        "description": "Stocks tumbled Friday, concluding the most volatile stretch the market has seen in more than a year by some measure."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Amazon Q2 2024 sees 11% revenue rise, AWS and AI growth By Investing.com",
        "description": "Earnings call: Amazon Q2 2024 sees 11% revenue rise, AWS and AI growth"
    },
    {
        "date": "2024-08-02",
        "title": "Nvidia CEO Jen-Hsun Huang sells over $27 million in company stock By Investing.com",
        "description": "Nvidia CEO Jen-Hsun Huang sells over $27 million in company stock"
    },
    {
        "date": "2024-08-02",
        "title": "Forexlive Americas FX news wrap 2 Aug: Bond market cuts rate for Fed after weak jobs data",
        "description": "Forex news for North American trading on Aug 2, 2024"
    },
    {
        "date": "2024-08-02",
        "title": "The Best Passive Income Idea for Young Adults",
        "description": "The rise of passive income streams has become an important global trend in recent years. According to a 2024 Bankrate survey, over one-third (36%) of US adults earn extra money through side hustles."
    },
    {
        "date": "2024-08-02",
        "title": "Nasdaq Enters Correction As Jobs Report Fuels Massive Stock Selloff",
        "description": "Drops for Intel and Amazon led the market slide, as Wall Street’s “fear gauge” reached its highest level in over a year."
    },
    {
        "date": "2024-08-02",
        "title": "Wall Street Collapses but Verizon, T-Mobile, and AT&T Rise. Here's Why",
        "description": "Investors sought safety today."
    },
    {
        "date": "2024-08-02",
        "title": "US court upholds rule granting work permits to visa holders' spouses By Reuters",
        "description": "US court upholds rule granting work permits to visa holders' spouses"
    },
    {
        "date": "2024-08-02",
        "title": "S&P 500 Falls For Third Straight Week, Middle East In Turmoil, Fed Holds Steady But Urgency For Rate Cuts Grows: This Week In The Market - Apple (NASDAQ:AAPL), Amazon.com (NASDAQ:AMZN)",
        "description": "The S&P 500 and Nasdaq 100 both saw declines, with Fed rate cut hints and geopolitical tensions dampening the market. Chip stocks and Amazon also fell."
    },
    {
        "date": "2024-08-02",
        "title": "Top Research Reports for Thermo Fisher Scientific, Micron Technology & KLA",
        "description": "Today's Research Daily features new research reports on 16 major stocks, including Thermo Fisher Scientific Inc. (TMO), Micron Technology, Inc. (MU) and KLA Corporation (KLAC), as well a micro-cap stock Moving iMage Technologies, Inc. (MITQ)."
    },
    {
        "date": "2024-08-02",
        "title": "Stock market news today: Nasdaq enters correction, Dow falls 600 points as disappointing jobs report shakes investors",
        "description": "The flight from stocks accelerated this week as earnings disappointments and soft economic data prompted investors to wonder whether the Fed will be too late in cutting rates next month."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Apple sets new June quarter revenue record at $85.8 billion By Investing.com",
        "description": "Earnings call: Apple sets new June quarter revenue record at $85.8 billion"
    },
    {
        "date": "2024-08-02",
        "title": "Stock Market Today: U.S. stocks fall sharply as Nasdaq lands in correction territory",
        "description": "Follow all the action in financial markets on Friday, after the 494-point slide in the Dow on Thursday."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: Marathon Digital outlines strategy amid $200 million loss By Investing.com",
        "description": "Earnings call: Marathon Digital outlines strategy amid $200 million loss"
    },
    {
        "date": "2024-08-02",
        "title": "VICR INVESTOR ALERT: Bronstein, Gewirtz & Grossman LLC Announces that Vicor Corporation Investors with Substantial Losses Have Opportunity to Lead Class Action Lawsuit!",
        "description": "NEW YORK, Aug.  02, 2024  (GLOBE NEWSWIRE) -- Attorney Advertising--Bronstein, Gewirtz & Grossman, LLC, a nationally recognized law firm, notifies..."
    },
    {
        "date": "2024-08-02",
        "title": "AIMD stock touches 52-week low at $0.63 amid market challenges By Investing.com",
        "description": "AIMD stock touches 52-week low at $0.63 amid market challenges"
    },
    {
        "date": "2024-08-02",
        "title": "'Like we've crashed into a brick wall': AI darlings sink as Nasdaq 100 enters correction territory",
        "description": "Amazon and Intel Corp. were among the biggest decliners. Amazon fell nearly 9% on Friday due to heavy AI spending plans, while Intel plummeted 27% following a grim forecast."
    },
    {
        "date": "2024-08-02",
        "title": "Why Bank Stocks Like Wells Fargo and JPMorgan Chase Are Tumbling Today",
        "description": "July's jobs report was surprisingly weak, putting pressure on the Federal Reserve to move more aggressively."
    },
    {
        "date": "2024-08-02",
        "title": "S&P 500 Earnings: Watch Credit Spreads to Gauge Recession Risk",
        "description": "Market Overview Analysis by Brian Gilmartin covering: S&P 500, United States 10-Year, iShares iBoxx $ Investment Grade Corporate Bond ETF, iShares iBoxx $ High Yield Corporate Bond ETF. Read Brian Gilmartin's latest article on Investing.com"
    },
    {
        "date": "2024-08-02",
        "title": "Takeda Pharmaceutical Company Limited (TAK) Q1 2025 Earnings Call Transcript",
        "description": "Takeda Pharmaceutical Company Limited (NYSE:NYSE:TAK) Q1 2025 Results Conference Call July 31, 2024 6:30 AM ETCompany ParticipantsChristopher O’Reilly -..."
    },
    {
        "date": "2024-08-02",
        "title": "VICR Class Action Alert: Robbins LLP Reminds Vicor Corporation Investors of the Lead Plaintiff Deadline in the VICR Class Action Lawsuit",
        "description": "Robbins LLP is Investigating Allegations that Vicor Corporation (VICR) Misled Investors Regarding its AI Platform\n..."
    },
    {
        "date": "2024-08-02",
        "title": "Earnings call: RLJ Lodging Trust reports a revenue growth of 3.4% By Investing.com",
        "description": "Earnings call: RLJ Lodging Trust reports a revenue growth of 3.4%"
    },
    {
        "date": "2024-08-02",
        "title": "Nvidia Stock Is Falling Again. When Will the Slide End?",
        "description": "Another day of weak economic data hit the stock again."
    },
    {
        "date": "2024-08-02",
        "title": "Chevron Dumps California for Texas After 145 Years",
        "description": "Chevron Corp., based in California since the days of kerosene lamps, is moving headquarters to Texas after years of fighting Golden State officials over strict environmental policies and costly regulations."
    },
    {
        "date": "2024-08-02",
        "title": "Here's why the market plunged Friday, and the series of stock buys we made in response",
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading."
    },
    {
        "date": "2024-08-02",
        "title": "Jeff Bezos loses $21 billion in net worth, a dive topped only by the wipeout after his divorce deal",
        "description": "Amazon stock fell as much as 13% Friday, dropping Bezos’ net worth to $185.3 billion, according to the Bloomberg Billionaires Index."
    },
    {
        "date": "2024-08-02",
        "title": "S&P 500, Dow, Nasdaq end sharply lower as weak jobs report triggers recession fears",
        "description": "All three major stock indices closed sharply lower as a weak jobs report triggers recession fears. Economists now see aggressive Fed rate cuts ahead."
    },
    {
        "date": "2024-08-02",
        "title": "Big Tech groups say their $100bn AI spending spree is just beginning",
        "description": "Technology stocks have been volatile as Microsoft, Meta, Amazon and Google report huge increases in their investments in artificial intelligence"
    },
    {
        "date": "2024-08-02",
        "title": "Meta, Amazon, and Alphabet are spending big in a battle to dominate AI. It might not end well.",
        "description": "Big Tech giants concede that AI is costing huge sums of money with little return on investment right now. But they say it's worth the risk."
    },
    {
        "date": "2024-08-02",
        "title": "Yacktman Asset Management's Strategic Exits and Acquisitions in Q2 2024",
        "description": "Highlighting the Complete Exit from Pioneer Natural Resources Co\n\nYacktman Asset Management (Trades, Portfolio), an Austin, Texas-based investment firm renowned"
    },
    {
        "date": "2024-08-02",
        "title": "Stocks fall sharply in broad-based sell-off after weak U.S. jobs report",
        "description": "The Dow Jones Industrial Average plunged by nearly 800 points during a Friday sell-off sparked by the Labor Department's employment report earlier in the day, with the other indexes following suit."
    },
    {
        "date": "2024-08-02",
        "title": "AppLovin: One Of The Best Stocks To Buy Now, I'm Ready For Loving (NASDAQ:APP)",
        "description": "AppLovin Corporation is expected to reach $110 per share in the near future, making it a promising investment opportunity. Learn more on APP stock here."
    },
    {
        "date": "2024-08-02",
        "title": "Chevron Dumps California for Texas After 145 Years",
        "description": "Chevron Corp., based in California since the days of kerosene lamps, is moving headquarters to Texas after years of fighting Golden State officials over strict envi…"
    },
    {
        "date": "2024-08-02",
        "title": "Global stocks sell-off deepens after US jobs shock",
        "description": "The global sell-off in stock markets deepened as US unemployment hit a three-year high amid growing fears that the US Federal Reserve has left it too late to begin cutting interest rates."
    },
    {
        "date": "2024-08-02",
        "title": "Amazon's shares slide after AI spending plans disappoints investors",
        "description": "The company projected operating income for the current quarter ending in September will be $11.5 billion to $15 billion. Analysts, on average, were looking for $15.7 billion"
    },
    {
        "date": "2024-08-02",
        "title": "U.S. Stocks Remain Sharply Lower After Early Sell-Off",
        "description": "After moving sharply lower early in the session, stocks continue to see significant weakness in afternoon trading on Friday. The major averages are adding to the steep losses posted in the previous session, with the tech-heavy Nasdaq falling to a two-month intraday low."
    },
    {
        "date": "2024-08-02",
        "title": "Lumen: Unwarranted Excitement (NYSE:LUMN)",
        "description": "Lumen's recent rally is unwarranted, and investors should be cautious as Lumen is unlikely to see significant sales growth or positive cash flows. Learn more on LUMN stock here."
    },
    {
        "date": "2024-08-02",
        "title": "Amazon Stock Slides As Consumer Concerns Overshadow AI Demand",
        "description": "Amazon stock is on pace Friday for its worst trading day so far in 2024 following its Q2 report. Here's why."
    },
    {
        "date": "2024-08-02",
        "title": "Bank stocks dive as weak jobs report boosts bets on Fed rate cuts (NASDAQ:NTRS)",
        "description": "Bank stocks tumble as weak jobs report raises expectations for aggressive rate cuts by the Fed, impacting lending profits positively and negatively."
    },
    {
        "date": "2024-08-02",
        "title": "Top Stock Movers Now: Amazon, Intel, Snap, and More",
        "description": "U.S. equities lost ground at midday Friday after a report showed the economy added fewer jobs than expected in July, while the unemployment rate rose."
    },
    {
        "date": "2024-08-02",
        "title": "Equities sell off, Nasdaq on track for correction, bond yields sink By Reuters",
        "description": "Equities sell off, Nasdaq on track for correction, bond yields sink"
    },
    {
        "date": "2024-08-02",
        "title": "Amazon stock tumbles 8% as profit, revenue outlook disappoints",
        "description": "Amazon reported second quarter earnings after the bell on Thursday that offered investors a disappointing outlook on its business for the current quarter."
    },
    {
        "date": "2024-08-02",
        "title": "Why Nvidia Stock Kept Tumbling on Friday",
        "description": "Investors should look closely at what tech executives are saying about artificial intelligence (AI) spending."
    },
    {
        "date": "2024-08-02",
        "title": "Nvidia: Tech stocks take a pounding as hedge fund Elliott warns AI is in 'bubble land'",
        "description": "Intel suffers its single biggest one day drop in decades, as sentiment sours amid overextended valuations and a darkening economic outlook."
    },
    {
        "date": "2024-08-02",
        "title": "Investor's Business Daily",
        "description": "The stock market took a bearish turn amid economic fears. Apple and Meta had strong results, while AI spending remains robust."
    },
    {
        "date": "2024-08-02",
        "title": "Tech-heavy Nasdaq sinks into correction zone as equity selloff worsens By Reuters",
        "description": "Tech-heavy Nasdaq sinks into correction zone as equity selloff worsens"
    },
    {
        "date": "2024-08-02",
        "title": "Alphabet Cut Its CrowdStrike Stake in Half Before Botched Software Update",
        "description": "A new regulatory filing revealed that the Google parent cut its stake in CrowdStrike in half before the cybersecurity firm's botched software update last month caused a global IT outage."
    },
    {
        "date": "2024-08-02",
        "title": "Paris Olympics Is Summer Davos for Wall Street Executives",
        "description": "It’s unclear how many Wall Street staff below the C-suite level made it to the Games."
    },
    {
        "date": "2024-08-02",
        "title": "Apple (NASDAQ: AAPL) Exceeds Wall Street Expectations With Strong Service Revenue",
        "description": ""
    },
    {
        "date": "2024-08-02",
        "title": "Nvidia: Recent Pullback Presents A Prime Buying Opportunity (NASDAQ:NVDA)",
        "description": "Nvidia is likely to remain the dominant force in the emerging advanced chips industry. Read why I think that NVDA is still a Strong Buy."
    }
]